[
  {
    "chapter": "1",
    "section": "1",
    "title": "Title and extent of operation of the Code",
    "description": "This Act shall be called the Indian Penal Code, and shall extend to the whole of India except the State of Jammu and Kashmir."
  },
  {
    "chapter": "1",
    "section": "2",
    "title": "Punishment of offences committed within India",
    "description": "Every person shall be liable to punishment under this Code and not otherwise for every act or omission contrary to the provisions thereof, of which he shall be guilty within 5 India"
  },
  {
    "chapter": "1",
    "section": "3",
    "title": "Punishment of offences committed beyond, but which by law may be tried within, India",
    "description": "Any person liable, by any Indian law, to be tried for an offence committed beyond India shall be dealt with according to the provisions of this Code for any act committed beyond India in the same manner as if such act had been committed within India."
  },
  {
    "chapter": "1",
    "section": "4",
    "title": "Extension of Code to extra-territorial offences",
    "description": "The provisions of this Code apply also to any offence committed by— (1) any citizen of India in any place without and beyond India;(2) any person on any ship or aircraft registered in India wherever it may be;(3) any person in any place without and beyond India committing offence targeting a computer resource located in India."
  },
  {
    "chapter": "1",
    "section": "5",
    "title": "Certain laws not to be affected by this Act",
    "description": "Nothing in this Act shall affect the provisions of any Act for punishing mutiny and desertion of officers, soldiers, sailors or airmen in the service of the Government of India or the provisions of any special or local law."
  },
  {
    "chapter": "2",
    "section": "6",
    "title": "Definitions in the Code to be understood subject to exceptions",
    "description": "Throughout this Code every definition of an offence, every penal provision, and every illustration of every such definition or penal provision, shall be understood subject to the exceptions contained in the Chapter entitled 'General Exceptions', though those exceptions are not repeated in such definition, penal provision, or illustration.",
    "additionalInfo": "Illustrations:(a) The sections, in this Code, which contain definitions of offences, do not express that a child under seven years of age cannot commit such offences; but the definitions are to be understood subject to the general exception which provides that nothing shall be an offence which is done by a child under seven years of age.(b) A, a police-officer, without warrant, apprehends Z, who has committed murder. Here A is not guilty of the offence of wrongful confinement; for he was bound by law to apprehend Z, and therefore the case falls within the general exception which provides that 'nothing is an offence which is done by a person who is bound by law to do it'."
  },
  {
    "chapter": "2",
    "section": "7",
    "title": "Sense of expression once explained",
    "description": "Every expression which is explained in any part of this Code, is used in every part of this Code in conformity with the explanation."
  },
  {
    "chapter": "2",
    "section": "8",
    "title": "Gender",
    "description": "The pronoun 'he' and its derivatives are used of any person, whether male or female"
  },
  {
    "chapter": "2",
    "section": "9",
    "title": "Number",
    "description": "Unless the contrary appears from the context, words importing the singular number include the plural number, and words importing the plural number include the singular number."
  },
  {
    "chapter": "2",
    "section": "10",
    "title": "'Man'.'Woman'.",
    "description": "The word 'man' denotes a male human being of any age; the word 'woman' denotes a female human being of any age"
  },
  {
    "chapter": "2",
    "section": "11",
    "title": "Person",
    "description": "The word 'person' includes any Company or Association or body of persons, whether incorporated or not"
  },
  {
    "chapter": "2",
    "section": "12",
    "title": "Public",
    "description": "The word 'public' includes any class of the public or any community"
  },
  {
    "chapter": "2",
    "section": "13",
    "title": "Definition of 'Queen'.",
    "description": "Omitted by the A. O. 1950."
  },
  {
    "chapter": "2",
    "section": "14",
    "title": "Servant of Government",
    "description": "The words 'servant of Government' denote any officer or servant continued, appointed or employed in India by or under the authority of Government."
  },
  {
    "chapter": "2",
    "section": "15",
    "title": "Definition of 'British India'.",
    "description": "Rep. by the A. O. 1937."
  },
  {
    "chapter": "2",
    "section": "16",
    "title": "Definition of “Government of India",
    "description": "Rep., ibid."
  },
  {
    "chapter": "2",
    "section": "17",
    "title": "Government",
    "description": "The word 'Government' denotes the Central Government or the Government of a State."
  },
  {
    "chapter": "2",
    "section": "18",
    "title": "India",
    "description": "'India' means the territory of India excluding the State of Jammu and Kashmir"
  },
  {
    "chapter": "2",
    "section": "19",
    "title": "Judge",
    "description": "The word 'Judge' denotes not only every person who is officially designated as a Judge, but also every person.",
    "additionalInfo": "who is empowered by law to give, in any legal proceeding, civil or criminal, a definitive judgment, or a judgment which, if not appealed against, would be definitive, or a judgment which, if confirmed by some other authority, would be definitive, or who is one of a body or persons, which body of persons is empowered by law to give such a judgment."
  },
  {
    "chapter": "2",
    "section": "20",
    "title": "Court of Justice",
    "description": "The words 'Court of Justice' denote a Judge who is empowered by law to act judicially alone, or a body of Judges which is empowered by law to act judicially as a body, when such Judge or body of Judges is acting judicially.",
    "additionalInfo": "A Panchayat acting under 4Regulation VII, 1816, of the Madras Code, having power to try and determine suits, is a Court of Justice."
  },
  {
    "chapter": "2",
    "section": "21",
    "title": "Public servant",
    "description": "The words “public servant” denote a person falling under any of the descriptions hereinafter following, namely:—Second.—Every Commissioned Officer in the Military, Naval or Air Forces of India; Third.—Every Judge including any person empowered by law to discharge, whether by himself or as a member of any body of persons, any adjudicatory functions;Fourth.—Every officer of a Court of Justice including a liquidator, receiver or commissioner whose duty it is, as such officer, to investigate or report on any matter of law or fact, or to make, authenticate, or keep any document, or to take charge or dispose of any property, or to execute any judicial process, or to administer any oath, or to interpret, or to preserve order in the Court, and every person specially authorised by a Court of Justice to perform any of such duties; Fifth.—Every juryman, assessor, or member of a panchayat assisting a Court of Justice or public servant; Sixth.—Every arbitrator or other person to whom any cause or matter has been referred for decisionor report by any Court of Justice, or by any other competent public authority; Seventh.—Every person who holds any office by virtue of which he is empowered to place or keep any person in confinement;Eighth.—Every officer of the Government whose duty it is, as such officer, to prevent offences, to give information of offences, to bring offenders to justice, or to protect the public health, safety or convenience; Ninth.—Every officer whose duty it is as such officer, to take, receive, keep or expend any property on behalf of the Government, or to make any survey, assessment or contract on behalf of the Government, or to execute any revenue-process, or to investigate, or to report, on any matter affecting the pecuniary interests of the Government, or to make, authenticate or keep any document relating to the pecuniary interests of the Government, or to prevent the infraction of any law for the protection of the pecuniary interests of the Government; Tenth.—Every officer whose duty it is, as such officer, to take, receive, keep or expend any property, to make any survey or assessment or to levy any rate or tax for any secular common purpose of any village, town or district, or to make, authenticate or keep any document for the ascertaining of the rights of the people of any village, town or district; Eleventh.—Every person who holds any office in virtue of which he is empowered to prepare, publish, maintain or revise an electoral roll or to conduct an election or part of an election; Twelfth.—Every person— (a) in the service or pay of the Government or remunerated by fees or commission for the performance of any public duty by the Government;(b) in the service or pay of a local authority, a corporation established by or under a Central, Provincial or State Act or a Government company as defined in section 617 of the Companies Act, 1956 (1 of 1956).]"
  },
  {
    "chapter": "2",
    "section": "22",
    "title": "Movable property",
    "description": "The words 'movable property' are intended to include corporeal property of every description, except land and things attached to the earth or permanently fastened to anything which is attached to the earth."
  },
  {
    "chapter": "2",
    "section": "23",
    "title": "Wrongful gain",
    "description": "Wrongful gain is gain by unlawful means of property to which the person gaining is not legally entitled."
  },
  {
    "chapter": "2",
    "section": "24",
    "title": "Dishonestly",
    "description": "Whoever does anything with the intention of causing wrongful gain to one person or wrongful loss to another person, is said to do that thing dishonestly."
  },
  {
    "chapter": "2",
    "section": "25",
    "title": "Fraudulently",
    "description": "A person is said to do a thing fraudulently if he does that thing with intent to defraud but not otherwise."
  },
  {
    "chapter": "2",
    "section": "26",
    "title": "Reason to believe",
    "description": "A person is said to have 'reason to believe' a thing, if he has sufficient cause to believe that thing but not otherwise"
  },
  {
    "chapter": "2",
    "section": "27",
    "title": "Property in possession of wife, clerk or servant",
    "description": "When property is in the possession of a person's wife, clerk or servant, on account of that person, it is in that person's possession within the meaning of this Code.",
    "additionalInfo": "A person employed temporarily or on a particular occasion in the capacity of a clerk or servant, is a clerk or servant within the meaning of this section."
  },
  {
    "chapter": "2",
    "section": "28",
    "title": "Counterfeit",
    "description": "A person is said to 'counterfeit' who causes one thing to resemble another thing, intending by means of that resemblance to practise deception, or knowing it to be likely that deception will thereby be practised.",
    "additionalInfo": "When a person causes one thing to resemble another thing, and the resemblance is such that a person might be deceived thereby, it shall be presumed, until the contrary is proved, that the person so causing the one thing to resemble the other thing intended by means of that resemblance to practise deception or knew it to be likely that deception would thereby be practised"
  },
  {
    "chapter": "2",
    "section": "29",
    "title": "Document",
    "description": "The word 'document' denotes any matter expressed or described upon any substance by means of letters, figures or marks, or by more than one of those means, intended to be used, or which may be used, as evidence of that matter.",
    "additionalInfo": "Whatever is expressed by means of letters, figures or marks as explained by mercantile or other usage, shall be deemed to be expressed by such letters, figures or marks within the meaning of this section, although the same may not be actually expressed."
  },
  {
    "chapter": "2",
    "section": "29a",
    "title": "Electronic record",
    "description": "The words 'electronic record' shall have the meaning assigned to them in clause (t) of sub-section (1) of section 2 of the Information Technology Act, 2000 (21 of 2000)."
  },
  {
    "chapter": "2",
    "section": "30",
    "title": "Valuable security",
    "description": "The words 'valuable security' denote a document which is, or purports to be, a document whereby any legal right is created, extended, transferred, restricted, extinguished or released, or whereby any person acknowledges that he lies under legal liability, or has not a certain legal right."
  },
  {
    "chapter": "2",
    "section": "31",
    "title": "A will",
    "description": "The words 'a will' denote any testamentary document"
  },
  {
    "chapter": "2",
    "section": "32",
    "title": "Words referring to acts include illegal omissions.",
    "description": "In every part of this Code, except where a contrary intention appears from the context, words which refer to acts done extend also to illegal omissions."
  },
  {
    "chapter": "2",
    "section": "33",
    "title": "'Act'.'Omission'",
    "description": "The word 'act' denotes as well as series of acts as a single act: the word 'omission' denotes as well a series of omissions as a single omission"
  },
  {
    "chapter": "2",
    "section": "34",
    "title": "Acts done by several persons in furtherance of common intention.",
    "description": "When a criminal act is done by several persons in furtherance of the common intention of all, each of such persons is liable for that act in the same manner as if it were done by him alone."
  },
  {
    "chapter": "2",
    "section": "35",
    "title": "When such an act is criminal by reason of its being done with a criminal knowledge or intention",
    "description": "Whenever an act, which is criminal only by reason of its being done with a criminal knowledge or intention, is done by several persons, each of such persons who joins in the act with such knowledge or intention is liable for the act in the same manner as if the act were done by him alone with that knowledge or intention."
  },
  {
    "chapter": "2",
    "section": "36",
    "title": "Effect caused partly by act and partly by omission",
    "description": "Wherever the causing of a certain effect, or an attempt to cause that effect, by an act or by an omission, is an offence, it is to be understood that the causing of that effect partly by an act and partly by an omission is the same offence.",
    "additionalInfo": "A intentionally causes Z's death, partly by illegally omitting to give Z food, and party by beating Z. A has committed murder."
  },
  {
    "chapter": "2",
    "section": "37",
    "title": "Co-operation by doing one of several acts constituting an offence",
    "description": "When an offence is committed by means of several acts, whoever intentionally co-operates in the commission of that offence by doing any one of those acts, either singly or jointly with any other person, commits that offence."
  },
  {
    "chapter": "2",
    "section": "38",
    "title": "Persons concerned in criminal act may be guilty of different offences",
    "description": "Where several persons are engaged or concerned in the commission of a criminal act, they may be guilty of different offences by means of that act.",
    "additionalInfo": "A attacks Z under such circumstances of grave provocation that his killing of Z would be only culpable homicide not amounting to murder. B, having ill-will towards Z and intending to kill him, and not having been subject to the provocation, assists A in killing Z. Here, though A and B are both engaged in causing Z's death, B is guilty of murder, and A is guilty only of culpable homicide."
  },
  {
    "chapter": "2",
    "section": "39",
    "title": "Voluntarily",
    "description": "A person is said to cause an effect 'voluntarily' when he causes it by means whereby he intended to cause it, or by means which, at the time of employing those means, he knew or had reason to believe to be likely to cause it.",
    "additionalInfo": "A sets fire, by night, to an inhabited house in a large town, for the purpose of facilitating a robbery and thus causes the death of a person. Here, A may not have intended to cause death; and may even be sorry that death has been caused by his act; yet, if he knew that he was likely to cause death, he has caused death voluntarily."
  },
  {
    "chapter": "2",
    "section": "40",
    "title": "Offence",
    "description": "Except in the Chapters and sections mentioned in clauses 2 and 3 of this section, the word 'offence' denotes a thing made punishable by this Code. In Chapter IV, Chapter V and in the following sections, namely, sections 64, 65, 66, 67, 71, 109, 110, 112, 114, 115, 116, 117, 118, 119 and 120 187, 194, 195, 203, 211, 213, 214, 221, 222, 223, 224, 225, 327, 328, 329, 330, 331, 347, 348, 388, 389 and 445, the word 'offence' denotes a thing punishable under this Code, or under any special or local law as hereinafter defined. And in sections 141, 176, 177, 201, 202, 212, 216 and 441, the word 'offence' has the same meaning when the thing punishable under the special or local law is punishable under such law with imprisonment for a term of six months or upwards, whether with or without fine."
  },
  {
    "chapter": "2",
    "section": "41",
    "title": "Special law",
    "description": "A 'special law' is a law applicable to a particular subject."
  },
  {
    "chapter": "2",
    "section": "42",
    "title": "Local law",
    "description": "A 'local law' is a law applicable only to a particular part of India."
  },
  {
    "chapter": "2",
    "section": "43",
    "title": "'Illegal'. 'Legally bound to do'",
    "description": "The word 'illegal' is applicable to everything which is an offence or which is prohibited by law, or which furnishes ground for a civil action; and a person is said to be 'legally bound to do' whatever it is illegal in him to omit."
  },
  {
    "chapter": "2",
    "section": "44",
    "title": "Injury",
    "description": "The word 'injury' denotes any harm whatever illegally caused to any person, in body, mind, reputation or property."
  },
  {
    "chapter": "2",
    "section": "45",
    "title": "Life",
    "description": "The word 'life' denotes the life of a human being, unless the contrary appears from the context."
  },
  {
    "chapter": "2",
    "section": "46",
    "title": "Death",
    "description": "The word 'death' denotes the death of a human being unless the contrary appears from the context."
  },
  {
    "chapter": "2",
    "section": "47",
    "title": "Animal",
    "description": "The word 'animal' denotes any living creature, other than a human being."
  },
  {
    "chapter": "2",
    "section": "48",
    "title": "Vessel",
    "description": "The word 'vessel' denotes anything made for the conveyance by water of human beings or of property."
  },
  {
    "chapter": "2",
    "section": "49",
    "title": "'Year'. 'Month'",
    "description": "Wherever the word 'year' or the word 'month' is used, it is to be understood that the year or the month is to be reckoned according to the British calendar."
  },
  {
    "chapter": "2",
    "section": "50",
    "title": "Section",
    "description": "The word 'section' denotes one of those portions of a Chapter of this Code which are distinguished by prefixed numeral figures."
  },
  {
    "chapter": "2",
    "section": "51",
    "title": "Oath",
    "description": "Oath”.—The word 'oath' includes a solemn affirmation substituted by law for an oath, and any declaration required or authorised by law to be made before a public servant or to be used for the purpose of proof, whether in a Court of Justice or not."
  },
  {
    "chapter": "2",
    "section": "52",
    "title": "Good faith",
    "description": "Nothing is said to be done or believed in 'good faith' which is done or believed without due care and attention."
  },
  {
    "chapter": "2",
    "section": "52A",
    "title": "Harbour",
    "description": "Except in section 157, and in section 130 in the case in which the harbour is given by the wife or husband of the person harboured, the word 'harbour' includes the supplying a person with shelter, food, drink, money, clothes, arms, ammunition or means of conveyance, or the assisting a person by any means, whether of the same kind as those enumerated in this section or not, to evade apprehension"
  },
  {
    "chapter": "3",
    "section": "53",
    "title": "Punishments",
    "description": "The punishments to which offenders are liable under the provisions of this Code are— First—Death;Secondly.—Imprisonment for life;Fourthly.—Imprisonment, which is of two descriptions, namely:—(1) Rigorous, that is, with hard labour;(2) Simple;Fifthly.—Forfeiture of property;Sixthly.—Fine."
  },
  {
    "chapter": "3",
    "section": "53A",
    "title": "Construction of reference to transportation",
    "description": "Subject to the provisions of sub-section (2) and sub-section (3), any reference to 'transportation for life' in any other law for the time being in force or in any instrument or order having effect by virtue of any such law or of any enactment repealed shall be construed as a reference to 'imprisonment for life'."
  },
  {
    "chapter": "3",
    "section": "54",
    "title": "Commutation of sentence of death",
    "description": "In every case in which sentence of death shall have been passed, the appropriate Government may, without the consent of the offender, commute the punishment punishment for any other punishment provided by this Code."
  },
  {
    "chapter": "3",
    "section": "55",
    "title": "Commutation of sentence of imprisonment for life",
    "description": "In every case in which sentence of imprisonment for life shall have been passed, the appropriate Government may, without the consent consent of the offender, commute the punishment for imprisonment of either description for a term not exceeding fourteen years."
  },
  {
    "chapter": "3",
    "section": "55A",
    "title": "Definition of 'appropriate Government'",
    "description": "In sections fifty-four and fifty-five the expression 'appropriate Government' means,— (a) in cases where the sentence is a sentence of death or is for an offence against any law relating to a matter to which the executive power of the Union extends, the Central Government; and (b) in cases where the sentence (whether of death or not) is for an offence against any law relating to a matter to which the executive power of the State extends, the Government of the State within which the offender is sentenced."
  },
  {
    "chapter": "3",
    "section": "56",
    "title": "Sentence of Europeans and Americans to penal servitude. Proviso as to sentence for term exceeding ten years but not for life.",
    "description": "Rep. by the Criminal Law (Removal of Racial Discriminations) Act, 1949 (17 of 1949) (w. e. f. 6-4-1949)"
  },
  {
    "chapter": "3",
    "section": "57",
    "title": "Fractions of terms of punishment.",
    "description": "In calculating fractions of terms of punishment, imprisonment for life shall be reckoned as equivalent to imprisonment for twenty years."
  },
  {
    "chapter": "3",
    "section": "58",
    "title": "Offenders sentenced to transportation how dealt with until transported",
    "description": "Rep. by the Code of Criminal Procedure (Amendment) Act, 1955 (26 of 1955), s. 117 and the Sch. (w.e.f. 1-1-1956)."
  },
  {
    "chapter": "3",
    "section": "59",
    "title": "Transportation instead of imprisonment",
    "description": "Rep. by s.117 and the Sch., ibid. (w.e.f. 1-1-1956)."
  },
  {
    "chapter": "3",
    "section": "60",
    "title": "Sentence may be (in certain cases of imprisonment) wholly or partly rigorous or simple.",
    "description": "In every case in which an offender is punishable with imprisonment which may be of either description, it shall be competent to the Court which sentences such offender to direct in the sentence that such imprisonment shall be wholly rigorous, or that such imprisonment shall be wholly simple, or that any part of such imprisonment shall be rigorous and the rest simple."
  },
  {
    "chapter": "3",
    "section": "61",
    "title": "Sentence of forfeiture of property",
    "description": "Rep. by the Indian Penal Code (Amendment) Act, 1921 (16 of 1921), s. 4."
  },
  {
    "chapter": "3",
    "section": "62",
    "title": "Forfeiture of property, in respect of offenders punishable with death, transportation or imprisonment.",
    "description": "Rep. by s. 4 ibid."
  },
  {
    "chapter": "3",
    "section": "63",
    "title": "Amount of fine.",
    "description": "Where no sum is expressed to which a fine may extend, the amount of fine to which the offender is liable is unlimited, but shall not be excessive."
  },
  {
    "chapter": "3",
    "section": "64",
    "title": "Sentence of imprisonment for non-payment of fine.",
    "description": "In every case of an offence punishable with imprisonment as well as fine, in which the offender is sentenced to a fine, whether with or without imprisonment, and in every case of an offence punishable with imprisonment or fine, or with fine only, in which the offender is sentenced to a fine. it shall be competent to the Court which sentences such offender to direct by the sentence that, in default of payment of the fine, the offender shall suffer imprisonment for a certain term, which imprisonment shall be in excess of any other imprisonment to which he may have been sentenced or to which he may be liable under a commutation of a sentence."
  },
  {
    "chapter": "3",
    "section": "65",
    "title": "Limit to imprisonment for non-payment of fine, when imprisonment and fine awardable",
    "description": "The term for which the Court directs the offender to be imprisoned in default of payment of a fine shall not exceed one-fourth of the term of imprisonment which is the maximum fixed for the offence, if the offence be punishable with imprisonment as well as fine."
  },
  {
    "chapter": "3",
    "section": "66",
    "title": "Description of imprisonment for non-payment of fine.",
    "description": "The imprisonment which the Court imposes in default of payment of a fine may be of any description to which the offender might have been sentenced for the offence."
  },
  {
    "chapter": "3",
    "section": "67",
    "title": "Imprisonment for non-payment of fine, when offence punishable with fine only.",
    "description": "If the offence be punishable with fine only, the imprisonment which the Court imposes in default of payment of the fine shall be simple, and] the term for which the Court directs the offender to be imprisoned, in default of payment of fine, shall not exceed the following scale, that is to say, for any term not exceeding two months when the amount of the fine shall not exceed fifty rupees, and for any term not exceeding four months when the amount shall not exceed one hundred rupees, and for any term not exceeding six months in any other case."
  },
  {
    "chapter": "3",
    "section": "68",
    "title": "Imprisonment to terminate on payment of fine.",
    "description": "The imprisonment which is imposed in default of payment of a fine shall terminate whenever that fine is either paid or levied by process of law."
  },
  {
    "chapter": "3",
    "section": "69",
    "title": "Termination of imprisonment on payment of proportional part of fine",
    "description": "If, before the expiration of the term of imprisonment fixed in default of payment, such a proportion of the fine be paid or levied that the term of imprisonment suffered in default of payment is not less than proportional to the part of the fine still unpaid, the imprisonment shall terminate."
  },
  {
    "chapter": "3",
    "section": "70",
    "title": "Fine leviable within six years, of during imprisonment. Death not to discharge property from liability.",
    "description": "The fine, or any part thereof which remains unpaid, may be levied at any time within six years after the passing of the sentence, and if, under the sentence, the offender be liable to imprisonment for a longer period than six years, then at any time previous to the expiration of that period; and the death of the offender does not discharge from the liability any property which would, after his death, be legally liable for his debts."
  },
  {
    "chapter": "3",
    "section": "71",
    "title": "Limit of punishment of offence made up of several offences",
    "description": "Where anything which is an offence is made up of parts, any of which parts is itself an offence, the offender shall not be punished with the punishment of more than one of such his offences, unless it be so expressly provided. Where anything is an offence falling within two or more separate definitions of any law in force for the time being by which offences are defined or punished, or where several acts, of which one or more than one would by itself or themselves constitute an offence, constitute, when combined, a different offence, the offender shall not be punished with a more severe punishment than the Court which tries him could award for any one of such offences.",
    "additionalInfo": "(a) A gives Z fifty strokes with a stick. Here A may have committed the offence of voluntarily causing hurt to Z by the whole beating, and also by each of the blows which make up the whole beating. If A were liable to punishment for every blow, he might be imprisoned for fifty years, one for each blow. But he is liable only to one punishment for the whole beating. (b) But, if, while A is beating Z, Y interferes, and A intentionally strikes Y, here, as the blow given to Y is no part of the act whereby A voluntarily causes hurt to Z, A is liable to one punishment for voluntarily causing hurt to Z, and to another for the blow given to Y."
  },
  {
    "chapter": "3",
    "section": "72",
    "title": "Punishment of person guilty of one of several offences, the judgment stating that it is doubtful of which",
    "description": "In all cases in which judgment is given that a person is guilty of one of several offences specified in the judgment, but that it is doubtful of which of these offences he is guilty, the offender shall be punished for the offence for which the lowest punishment is provided if the same punishment is not provided for all."
  },
  {
    "chapter": "3",
    "section": "73",
    "title": "Solitary confinement.",
    "description": "Whenever any person is convicted of an offence for which under this Code the Court has power to sentence him to rigorous imprisonment, the Court may, by its sentence, order that the offender shall be kept in solitary confinement for any portion or portions of the imprisonment to which he is sentenced, not exceeding three months in the whole, according to the following scale, that is to say— a time not exceeding one month if the term of imprisonment shall not exceed six months; a time not exceeding two months if the term of imprisonment shall exceed six months and shall not exceed one year a time not exceeding three months if the term of imprisonment shall exceed one year."
  },
  {
    "chapter": "3",
    "section": "74",
    "title": "Limit of solitary confinement.",
    "description": "In executing a sentence of solitary confinement, such confinement shall in no case exceed fourteen days at a time, with intervals between the periods of solitary confinement of not less duration than such periods; and when the imprisonment awarded shall exceed three months, the solitary confinement shall not exceed seven days in any one month of the whole imprisonment awarded, with intervals between the periods of solitary confinement of not less duration than such periods."
  },
  {
    "chapter": "3",
    "section": "75",
    "title": "Enhanced punishment for certain offences under Chapter XII or Chapter XVII after previous conviction",
    "description": "Whoever, having been convicted,— (a) by a Court in India, of an offence punishable under Chapter XII or Chapter XVII of this Code with imprisonment of either description for a term of three years or upwards, shall be guilty of any offence punishable under either of those Chapters with like imprisonment for the like term, shall be subject for every such subsequent offence to imprisonment for life, or to imprisonment of either description for a term which may extend to ten years."
  },
  {
    "chapter": "4",
    "section": "76",
    "title": "Act done by a person bound, or by mistake of fact believing himself bound, by law.",
    "description": "Nothing is an offence which is done by a person who is, or who by reason of a mistake of fact and not by reason of a mistake of law in good faith believes himself to be, bound by law to do it.",
    "additionalInfo": "(a) A, a soldier, fires on a mob by the order of his superior officer, in conformity with the commands of the law. A has committed no offence. (b) A, an officer of a Court of Justice, being ordered by that Court to arrest Y, and after due enquiry, believing Z to be Y, arrests Z. A has committed no offence."
  },
  {
    "chapter": "4",
    "section": "77",
    "title": "Act of Judge when acting judicially.",
    "description": "Nothing is an offence which is done by a Judge when acting judicially in the exercise of any power which is, or which in good faith he believes to be, given to him by law."
  },
  {
    "chapter": "4",
    "section": "78",
    "title": "Act done pursuant to the judgment or order of Court",
    "description": "Nothing which is done in pursuance of, or which is warranted by the judgment or order of, a Court of Justice; if done whilst such judgment or order remains in force, is an offence, notwithstanding the Court may have had no jurisdiction to pass such judgment or order, provided the person doing the act in good faith believes that the Court had such jurisdiction."
  },
  {
    "chapter": "4",
    "section": "79",
    "title": "Act done by a person justified, or by mistake of fact believing himself, justified, by law",
    "description": "Nothing is an offence which is done by any person who is justified by law, or who by reason of a mistake of fact and not by reason of a mistake of law in good faith, believes himself to be justified by law, in doing it.",
    "additionalInfo": "A sees Z commit what appears to A to be a murder. A, in the exercise, to the best of his judgment exerted in good faith, of the power which the law gives to all persons of apprehending murderers in the fact, seizes Z, in order to bring Z before the proper authorities. A has committed no offence, though it may turn out that Z was acting in self-defence."
  },
  {
    "chapter": "4",
    "section": "80",
    "title": "Accident in doing a lawful act",
    "description": "Nothing is an offence which is done by accident or misfortune, and without any criminal intention or knowledge in the doing of a lawful act in a lawful manner by lawful means and with proper care and caution.",
    "additionalInfo": "A is at work with a hatchet; the head flies off and kills a man who is standing by. Here, if there was no want of proper caution on the part of A, his act is excusable and not an offence."
  },
  {
    "chapter": "4",
    "section": "81",
    "title": "Act likely to cause harm, but done without criminal intent, and to prevent other harm",
    "description": "Nothing is an offence merely by reason of its being done with the knowledge that it is likely to cause harm, if it be done without any criminal intention to cause harm, and in good faith for the purpose of preventing or avoiding other harm to person or property.",
    "additionalInfo": "It is a question of fact in such a case whether the harm to be prevented or avoided was of such a nature and so imminent as to justify or excuse the risk of doing the act with the knowledge that it was likely to cause harm."
  },
  {
    "chapter": "4",
    "section": "82",
    "title": "Act of a child under seven years of age.",
    "description": "Nothing is an offence which is done by a child under seven years of age."
  },
  {
    "chapter": "4",
    "section": "83",
    "title": "Act of a child above seven and under twelve of immature understanding",
    "description": "Nothing is an offence which is done by a child above seven years of age and under twelve, who has not attained sufficient maturity of understanding to judge of the nature and consequences of his conduct on that occasion."
  },
  {
    "chapter": "4",
    "section": "84",
    "title": "Act of a person of unsound mind.",
    "description": "Nothing is an offence which is done by a person who, at the time of doing it, by reason of unsoundness of mind, is incapable of knowing the nature of the act, or that he is doing what is either wrong or contrary to law."
  },
  {
    "chapter": "4",
    "section": "85",
    "title": "Act of a person incapable of judgment by reason of intoxication caused against his will",
    "description": "Nothing is an offence which is done by a person who, at the time of doing it, is, by reason of intoxication, incapable of knowing the nature of the act, or that he is doing what is either wrong, or contrary to law: provided that the thing which intoxicated him was administered to him without his knowledge or against his will."
  },
  {
    "chapter": "4",
    "section": "86",
    "title": "Offence requiring a particular intent or knowledge committed by one who is intoxicated",
    "description": "In cases where an act done is not an offence unless done with a particular knowledge or intent, a person who does the act in a state of intoxication shall be liable to be dealt with as if he had the same knowledge as he would have had if he had not been intoxicated, unless the thing which intoxicated him was administered to him without his knowledge or against his will."
  },
  {
    "chapter": "4",
    "section": "87",
    "title": "Act not intended and not known to be likely to cause death or grievous hurt, done by consent",
    "description": "Nothing which is not intended to cause death, or grievous hurt, and which is not known by the doer to be likely to cause death or grievous hurt, is an offence by reason of any harm which it may cause, or be intended by the doer to cause, to any person, above eighteen years of age, who has given consent, whether express or implied, to suffer that harm; or by reason of any harm which it may be known by the doer to be likely to cause to any such person who has consented to take the risk of that harm.",
    "additionalInfo": "A and Z agree to fence with each other for amusement. This agreement implies the consent of each to suffer any harm which, in the course of such fencing, may be caused without foul play; and if A, while playing fairly, hurts Z, A commits no offence."
  },
  {
    "chapter": "4",
    "section": "88",
    "title": "Act not intended to cause death, done by consent in good faith for person's benefit",
    "description": "Nothing, which is not intented to cause death, is an offence by reason of any harm which it may cause, or be intended by the doer to cause, or be known by the doer to be likely to cause, to any person for whose benefit it is done in good faith, and who has given a consent, whether express or implied, to suffer that harm, or to take the risk of that harm.",
    "additionalInfo": "A, a surgeon, knowing that a particular operation is likely to cause the death of Z, who suffers under the painful complaint, but not intending to cause Z's death, and intending, in good faith, Z's benefit, performs that operation on Z, with Z's consent. A has committed no offence."
  },
  {
    "chapter": "4",
    "section": "89",
    "title": "Act done in good faith for benefit of child or insane person, by or by consent of guardian",
    "description": "Nothing which is done in good faith for the benefit of a person under twelve years of age, or of unsound mind, by or by consent, either express or implied, of the guardian or other person having lawful charge of that person, is an offence by reason of any harm which it may cause, or be intended by the doer to cause or be known by the doer to be likely to cause to that person: Provided— Provisos. First.—That this exception shall not extend to the intentional causing of death, or to the attempting to cause death; Secondly.—That this exception shall not extend to the doing of anything which the person doing it knows to be likely to cause death, for any purpose other than the preventing of death or grievous hurt, or the curing of any grievous disease or infirmity; Thirdly.—That this exception shall not extend to the voluntary causing of grievous hurt, or to the attempting to cause grievous hurt, unless it be for the purpose of preventing death or grievous hurt, or the curing of any grievous disease or infirmity; Fourthly.—That this exception shall not extend to the abetment of any offence, to the committing of which offence it would not extend.",
    "additionalInfo": "A, in good faith, for his child's benefit without his child's consent, has his child cut for the stone by a surgeon knowing it to be likely that the operation will cause the child's death, but not intending to cause the child's death. A is within the exception, inasmuch as his object was the cure of the child."
  },
  {
    "chapter": "4",
    "section": "90",
    "title": "Consent known to be given under fear or misconception.",
    "description": "A consent is not such a consent as is intended by any section of this Code, if the consent is given by a person under fear of injury, or under a misconception of fact, and if the person doing the act knows, or has reason to believe, that the consent was given in consequence of such fear or misconception; or Consent of insane person.—if the consent is given by a person who, from unsoundness of mind, or intoxication, is unable to understand the nature and consequence of that to which he gives his consent; or Consent of child.—unless the contrary appears from the context, if the consent is given by a person who is under twelve years of age."
  },
  {
    "chapter": "4",
    "section": "91",
    "title": "Exclusion of acts which are offences independently of harm cause.",
    "description": "The exceptions in sections 87, 88 and 89 do not extend to acts which are offences independently of any harm which they may cause, or be intended to cause, or be known to be likely to cause, to the person giving the consent, or on whose behalf the consent is given.",
    "additionalInfo": "Causing miscarriage (unless caused in good faith for the purpose of saving the life of the woman) is offence independently of any harm which it may cause or be intended to cause to the woman. Therefore, it is not an offence 'by reason of such harm'; and the consent of the woman or of her guardian to the causing of such miscarriage does not justify the act."
  },
  {
    "chapter": "4",
    "section": "92",
    "title": "Act done in good faith for benefit of a person without consent",
    "description": "Nothing is an offence by reason of any harm which it may cause to a person for whose benefit it is done in good faith, even without that person's consent, if the circumstances are such that it is impossible for that person to signify consent, or if that person is incapable of giving consent, and has no guardian or other person in lawful charge of him from whom it is possible to obtain consent in time for the thing to be done with benefit: Provided— Provisos. First.—That this exception shall not extend to the intentional causing of death, or the attempting to cause death; Secondly.—That this exception shall not extend to the doing of anything which the person doing it knows to be likely to cause death, for any purpose other than the preventing of death or grievous hurt, or the curing of any grievous disease or infirmity; Thirdly.—That this exception shall not extend to the voluntary causing of hurt, or to the attempting to cause hurt, for any purpose other than the preventing of death or hurt; Fourthly.—That this exception shall not extend to the abetment of any offence, to the committing of which offence it would not extend.",
    "additionalInfo": "(a) Z is thrown from his horse, and is insensible. A, a surgeon, finds that Z requires to be trepanned. A, not intending Z's death, but in good faith, for Z's benefit, performs the trepan before Z recovers his power of judging for himself. A has committed no offence. (b) Z is carried off by a tiger. A fires at the tiger knowing it to be likely that the shot may kill Z, but not intending to kill Z, and in good faith intending Z's benefit. A's ball gives Z a mortal wound. A has committed no offence. (c) A, a surgeon, sees a child suffer an accident which is likely to prove fatal unless an operation be immediately performed. There is not time to apply to the child's guardian. A performs the operation in spite of the entreaties of the child, intending, in good faith, the child's benefit. A has committed no offence. (d) A is in a house which is on fire, with Z, a child. People below hold out a blanket. A drops the child from the housestop, knowing it to be likely that the fall may kill the child, but not intending to kill the child, and intending, in good faith, the child's benefit. Here, even if the child is killed by the fall, A has committed no offence. Explanation.—Mere pecuniary benefit is not benefit within the meaning of sections 88, 89 and 92."
  },
  {
    "chapter": "4",
    "section": "93",
    "title": "Communication made in good faith.",
    "description": "No communication made in good faith is an offence by reason of any harm to the person to whom it is made, if it is made for the benefit of that person.",
    "additionalInfo": "A, a surgeon, in good faith, communicates to a patient his opinion that he cannot live. The patient dies in consequence of the shock. A has committed no offence, though he knew it to be likely that the communication might cause the patient's death."
  },
  {
    "chapter": "4",
    "section": "94",
    "title": "Act to which a person is compelled by threats.",
    "description": "Except murder, and offences against the State punishable with death, nothing is an offence which is done by a person who is compelled to do it by threats, which, at the time of doing it, reasonably cause the apprehension that instant death to that person will otherwise be the consequence: Provided the person doing the act did not of his own accord, or from a reasonable apprehension of harm to himself short of instant death, place himself in the situation by which he became subject to such constraint.",
    "additionalInfo": "Explanation 1.—A person who, of his own accord, or by reason of a threat of being beaten, joins a gang of dacoits, knowing their character, is not entitled to the benefit of this exception, on the ground of his having been compelled by his associates to do anything that is an offence by law. Explanation 2.—A person seized by a gang of dacoits, and forced, by threat of instant death, to do a thing which is an offence by law; for example, a smith compelled to take his tools and to force the door of a house for the dacoits to enter and plunder it, is entitled to the benefit of this exception."
  },
  {
    "chapter": "4",
    "section": "95",
    "title": "Act causing slight harm.",
    "description": "Nothing is an offence by reason that it causes, or that it is intended to cause, or that it is known to be likely to cause, any harm, if that harm is so slight that no person of ordinary sense and temper would complain of such harm."
  },
  {
    "chapter": "4",
    "section": "96",
    "title": "Things done in private defence.",
    "description": "Nothing is an offence which is done in the exercise of the right of private defence."
  },
  {
    "chapter": "4",
    "section": "97",
    "title": "Right of private defence of the body and of property",
    "description": "Every person has a right, subject to the restrictions contained in section 99, to defend— First.—His own body, and the body of any other person, against any offence affecting the human body; Secondly.—The property, whether movable or immovable, of himself or of any other person, against any act which is an offence falling under the defintion of theft, robbery, mischief or criminal trespass, or which is an attempt to commit theft, robbery, mischief or criminal trespass."
  },
  {
    "chapter": "4",
    "section": "98",
    "title": "Right of private defence against the act of a person of unsound mind, etc",
    "description": "When an act, which would otherwise be a certain offence, is not that offence, by reason of the youth, the want of maturity of understanding, the unsoundness of mind or the intoxication of the person doing that act, or by reason of any misconception on the part of that person, every person has the same right of private defence against that act which he would have if the act were that offence.",
    "additionalInfo": "(a) Z, under the influence of madness, attempts to kill A; Z is guilty of no offence. But A has the same right of private defence which he would have if Z were sane. (b) A enters by night a house which he is legally entitled to enter. Z, in good faith, taking A for a house-breaker, attacks A. Here Z, by attacking A under this misconception, commits no offence. But A has the same right of private defence against Z, which he would have if Z were not acting under that misconception."
  },
  {
    "chapter": "4",
    "section": "99",
    "title": "Acts against which there is no right of private defence",
    "description": "There is no right of private defence against an act which does not reasonably cause the apprehension of death or of grievous hurt, if done, or attempted to be done, by a public servant acting in good faith under colour of his office, though that act, may not be strictly justifiable by law. There is no right of private defence against an act which does not reasonably cause the apprehension of death or of grievous hurt, if done, or attempted to be done, by the direction of a public servant acting in good faith under colour of his office, though that direction may not be strictly justifiable by law. There is no right of private defence in cases in which there is time to have recourse to protection of the public authorities.",
    "additionalInfo": "Extent to which the right may be exercised.—The right of private defence in no case extends to the inflicting of more harm than it is necessary to inflict for the purpose of defence."
  },
  {
    "chapter": "4",
    "section": "100",
    "title": "When the right of private defence of the body extends to causing death",
    "description": "The right of private defence of the body extends, under the restrictions mentioned in the last preceding section, to the voluntary causing of death or of any other harm to the assailant, if the offence which occasions the exercise of the right be of any of the descriptions hereinafter enumerated, namely:— First.—Such an assault as may reasonably cause the apprehension that death will otherwise be the consequence of such assault;Secondly.—Such an assault as may reasonably cause the apprehension that grievous hurt will otherwise be the consequence of such assault; Thirdly.—An assault with the intention of committing rape; Fourthly.—An assault with the intention of gratifying unnatural lust; Fifthly.—An assault with the intention of kidnapping or abducting; Sixthly.—An assault with the intention of wrongfully confining a person, under circumstances which may reasonably cause him to apprehend that he will be unable to have recourse to the public authorities for his release. Seventhly.—An act of throwing or administering acid or an attempt to throw or administer acid which may reasonably cause the apprehension that grievous hurt will otherwise be the consequence of such act."
  },
  {
    "chapter": "4",
    "section": "101",
    "title": "When such right extends to causing any harm other than death.",
    "description": "If the offence be not of any of the descriptions enumerated in the last preceding section, the right of private defence of the body does not extend to the voluntary causing of death to the assailant, but does extend, under the restrictions mentioned in section 99, to the voluntary causing to the assailant of any harm other than death."
  },
  {
    "chapter": "4",
    "section": "102",
    "title": "Commencement and continuance of the right of private defence of the body",
    "description": "The right of private defence of the body commences as soon as a reasonable apprehension of danger to the body arises from an attempt or threat to commit the offence though the offence may not have been committed; and it continues as long as such apprehension of danger to the body continues."
  },
  {
    "chapter": "4",
    "section": "103",
    "title": "When the right of private defence of property extends to causing death",
    "description": "The right of private defence of property extends, under the restrictions mentioned in section 99, to the voluntary causing of death or of any other harm to the wrong-doer, if the offence, the committing of which, or the attempting to commit which, occasions the exercise of the right, be an offence of any of the descriptions hereinafter enumerated, namely:— First.—Robbery; Secondly.—House-breaking by night; Thirdly.—Mischief by fire committed on any building, tent or vessel, which building, tent or vessel is used as a human dwelling, or as a place for the custody of property; Fourthly.—Theft, mischief, or house-trespass, under such circumstances as may reasonably cause apprehension that death or grievous hurt will be the consequence, if such right of private defence is not exercised."
  },
  {
    "chapter": "4",
    "section": "104",
    "title": "When such right extends to causing any harm other than death",
    "description": "If the offence, the committing of which, or the attempting to commit which occasions the exercise of the right of private defence, be theft, mischief, or criminal trespass, not of any of the descriptions enumerated in the last preceding section, that right does not extend to the voluntary causing of death, but does extend, subject to the restrictions mentioned in section 99, to the voluntary causing to the wrong-doer of any harm other than death."
  },
  {
    "chapter": "4",
    "section": "105",
    "title": "Commencement and continuance of the right of private defence of property",
    "description": "The right of private defence of property commences when a reasonable apprehension of danger to the property commences. The right of private defence of property against theft continues till the offender has effected his retreat with the property or either the assistance of the public authorities is obtained, or the property has been recovered. The right of private defence of property against robbery continues as long as the offender causes or attempts to cause to any person death or hurt or wrongful restraint or as long as the fear of instant death or of instant hurt or of instant personal restraint continues. The right of private defence of property against criminal trespass or mischief continues as long as the offender continues in the commission of criminal trespass or mischief. The right of private defence of property against house-breaking by night continues as long as the house-trespass which has been begun by such house-breaking continues."
  },
  {
    "chapter": "4",
    "section": "106",
    "title": "Right of private defence against deadly assault when there is risk of harm to innocent person",
    "description": "If in the exercise of the right of private defence against an assault which reasonably causes the apprehension of death, the defender be so situated that he cannot effectually exercise that right without risk of harm to an innocent person, his right of private defence extends to the running of that risk.",
    "additionalInfo": "A is attacked by a mob who attempt to murder him. He cannot effectually exercise his right of private defence without firing on the mob, and he cannot fire without risk of harming young children who are mingled with the mob. A commits no offence if by so firing he harms any of the children."
  },
  {
    "chapter": "5",
    "section": "107",
    "title": "Abetment of a thing",
    "description": "Engages with one or more other person or persons in any conspiracy for the doing of that thing, if an act or illegal omission takes place in pursuance of that conspiracy, and in order to the doing of that thing"
  },
  {
    "chapter": "5",
    "section": "108",
    "title": "Abettor",
    "description": "A person abets an offence, who abets either the commission of an offence, or the commission of an act which would be an offence, if committed by a person capable by law of committing an offence with the same intention or knowledge as that of the abettor"
  },
  {
    "chapter": "5",
    "section": "108A",
    "title": "Abetment in India of offences outside India",
    "description": "A person abets an offence within the meaning of this Code who, in 2 [India], abets the commission of any act without and beyond 2 [India] which would constitute an offence if committed in 2 [India]"
  },
  {
    "chapter": "5",
    "section": "109",
    "title": "Punishment of abetment if the act abetted is committed in consequence and where no express provision is made for its punishment",
    "description": "Whoever abets any offence shall, if the act abetted is committed in consequence of the abetment, and no express provision is made by this Code for the punishment of such abetment, be punished with the punishment provided for the offence"
  },
  {
    "chapter": "5",
    "section": "110",
    "title": "Punishment of abetment if person abetted does act with different intention from that of abettor",
    "description": "Whoever abets the commission of an offence shall, if the person abetted does the act with a different intention or knowledge from that of the abettor, be punished with the punishment provided for the offence which would have been committed if the act had been done with the intention or knowledge of the abettor and with no other"
  },
  {
    "chapter": "5",
    "section": "111",
    "title": "Liability of abettor when one act abetted and different act done",
    "description": "When an Act is abetted and a different act is done, the abettor is liable for the act done, in the same manner and to the same extent as if he had directly abetted it"
  },
  {
    "chapter": "5",
    "section": "112",
    "title": "Abettor when liable to cumulative punishment for act abetted and for act done",
    "description": "If the act for which the abettor is liable under the last preceding section is committed in addition to the act abetted, and constitute a distinct offence, the abettor is liable to punishment for each of the offences"
  },
  {
    "chapter": "5",
    "section": "113",
    "title": "Liability of abettor for an effect caused by the act abetted different from that intended by the abettor",
    "description": "When an act is abetted with the intention on the part of the abettor of causing a particular effect, and an act for which the abettor is liable in consequence of the abetment, causes a different effect from that intended by the abettor, the abettor is liable for the effect caused, in the same manner and to the same extent as if he had abetted the act with the intention of causing that effect, provided he knew that the act abetted was likely to cause that effect"
  },
  {
    "chapter": "5",
    "section": "114",
    "title": "Abettor present when offence is committed",
    "description": "Whenever any person, who is absent would be liable to be punished as an abettor, is present when the act or offence for which he would be punishable in consequence of the abetment is committed, he shall be deemed to have committed such act or offence"
  },
  {
    "chapter": "5",
    "section": "115",
    "title": "Abetment of offence punishable with death or imprisonment for life.—if offence not committed",
    "description": "Whoever abets the commission of an offence punishable with death or 1 [imprisonment for life], shall, if that offence be not committed in consequence of the abetment, and no express provision is made by this Code for the punishment of such abetment, be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine"
  },
  {
    "chapter": "5",
    "section": "116",
    "title": "Abetment of offence punishable with imprisonment—if offence be not committed",
    "description": "Whoever abets an offence punishable with imprisonment shall, if that offence be not committed in consequence of the abetment, and no express provision is made by this Code for the punishment of such abetment"
  },
  {
    "chapter": "5",
    "section": "117",
    "title": "Abetting commission of offence by the public or by more than ten persons",
    "description": "Whoever abets the commission of an offence by the public generally or by any number or class of persons exceeding ten, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both"
  },
  {
    "chapter": "5",
    "section": "118",
    "title": "Concealing design to commit offence punishable with death or imprisonment for life",
    "description": "Whoever intending to facilitate or knowing it to be likely that he will thereby facilitate the commission of an offence punishable with death or 1 [imprisonment for life]"
  },
  {
    "chapter": "5",
    "section": "119",
    "title": "Public servant concealing design to commit offence which it is his duty to prevent",
    "description": "Whoever, being a public servant intending to facilitate or knowing it to be likely that he will thereby facilitate the commission of an offence which it is his duty as such public servant to prevent"
  },
  {
    "chapter": "5",
    "section": "120",
    "title": "Concealing design to commit offence punishable with imprisonment",
    "description": "Whoever, intending to facilitate or knowing it to be likely that he will thereby facilitate the commission of an offence punishable with imprisonment"
  },
  {
    "chapter": "5A",
    "section": "120A",
    "title": "Definition of criminal conspiracy",
    "description": "When two or more persons agree to do, or cause to be done"
  },
  {
    "chapter": "5A",
    "section": "120B",
    "title": "Punishment of criminal conspiracy",
    "description": "Whoever is a party to a criminal conspiracy to commit an offence punishable with death, 1 [imprisonment for life] or rigorous imprisonment for a term of two years or upwards, shall, where no express provision is made in this Code for the punishment of such a conspiracy, be punished in the same manner as if he had abetted such offence"
  },
  {
    "chapter": "6",
    "section": "121",
    "title": "Waging, or attempting to wage war, or abetting waging of war, against the Government of India",
    "description": "Whoever wages war against the 2 [Government of India], or attempts to wage such war, or abets the waging of such war, shall be punished with death, or 3 [imprisonment for life] 4 [and shall also be liable to fine]"
  },
  {
    "chapter": "6",
    "section": "121A",
    "title": "Conspiracy to commit offences punishable by section 121",
    "description": "Whoever within or without [India] conspires to commit any of the offences punishable by section 121"
  },
  {
    "chapter": "6",
    "section": "122",
    "title": "Collecting arms, etc., with intention of waging war against the Government of India",
    "description": "Whoever collects men, arms or ammunition or otherwise prepares to wage war with the intention of either waging or being prepared to wage war against the 2 [Government of India], shall be punished with"
  },
  {
    "chapter": "6",
    "section": "123",
    "title": "Concealing with intent to facilitate design to wage war",
    "description": "Whoever by any act, or by any illegal omission, conceals the existence of a design to wage war against the 3 [Government of India],"
  },
  {
    "chapter": "6",
    "section": "124",
    "title": "Assaulting President, Governor, etc., with intent to compel or restrain the exercise of any lawful power",
    "description": "shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine"
  },
  {
    "chapter": "6",
    "section": "125",
    "title": "Waging war against any Asiatic Power in alliance with the Government of India",
    "description": "Whoever wages war against the Government of any Asiatic Power in alliance or at peace with the 3 [Government of India] or attempts to wage such war, or abets the waging of such war, shall be punished with 1 [imprisonment for life]"
  },
  {
    "chapter": "6",
    "section": "126",
    "title": "Committing depredation on territories of Power at peace with the Government of India",
    "description": "Whoever commits depredation, or makes preparations to commit depredation, on the territories of any Power in alliance or at peace with the 1 [Government of India], shall be punished with imprisonment"
  },
  {
    "chapter": "6",
    "section": "127",
    "title": "Receiving property taken by war or depredation mentioned in sections 125 and 126",
    "description": "Whoever receives any property knowing the same to have been taken in the commission of any of the offences mentioned in sections 125 and 126"
  },
  {
    "chapter": "6",
    "section": "128",
    "title": "Public servant voluntarily allowing prisoner of state or war to escape",
    "description": "Whoever, being a public servant and having the custody of any State prisoner or prisoner of war, voluntarily allows such prisoner to escape from any place in which such prisoner is confined"
  },
  {
    "chapter": "6",
    "section": "129",
    "title": "Public servant negligently suffering such prisoner to escape",
    "description": "Whoever, being a public servant and having the custody of any State prisoner or prisoner of war, negligently suffers such prisoner to escape from any place of confinement in which such prisoner is confined"
  },
  {
    "chapter": "6",
    "section": "130",
    "title": "Aiding escape of, rescuing or harbouring such prisoner",
    "description": "Whoever knowingly aids or assists any State prisoner or prisoner of war in escaping from lawful custody, or rescues or attempts to rescue any such prisoner, or harbours or conceals any such prisoner who has escaped from lawful custody"
  },
  {
    "chapter": "7",
    "section": "131",
    "title": "Abetting mutiny, or attempting to seduce a soldier, sailor or airman from his duty",
    "description": "Whoever abets the committing of mutiny by an officer, soldier, 5 [sailor or airman], in the Army, 6 [Navy or Air Force] of the 1 [Government of India] or attempts to seduce any such officer, soldier, 5 [sailor or airman] from his allegiance or his duty"
  },
  {
    "chapter": "7",
    "section": "132",
    "title": "Abetment of mutiny, if mutiny is committed in consequence thereof",
    "description": "Whoever abets the committing of mutiny by an officer, soldier, 8 [sailor or airman], in the Army, 9 [Navy or Air Force] of the 10 [Government of India], shall, if mutiny be committed in consequence of that abetment, be punished with death or with 11 [imprisonment for life], or imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "chapter": "7",
    "section": "133",
    "title": "Abetment of assault by soldier, sailor or airman on his superior officer, when in execution of his office",
    "description": "Whoever abets an assault by an officer, soldier, 8 [sailor or airman], in the Army, 9 [Navy or Air Force] of the 10 [Government of India], on any superior officer being in the execution of his office, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine."
  },
  {
    "chapter": "7",
    "section": "134",
    "title": "Abetment of such assault, if the assault committed",
    "description": "Whoever abets an assault by an officer, soldier, 8 [sailor or airman], in the Army, 9 [Navy or Air Force] of the 10 [Government of India], on any superior officer being in the execution of his office, shall, if such assault be committed in consequence of that abetment be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine"
  },
  {
    "chapter": "7",
    "section": "135",
    "title": "Abetment of desertion of soldier, sailor or airman",
    "description": "Whoever, abets the desertion of any officer, soldier, 8 [sailor or airman], in the Army, 9 [Navy or Air Force] of the 10 [Government of India], shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both"
  },
  {
    "chapter": "7",
    "section": "136",
    "title": "Harbouring deserter",
    "description": "Whoever, except as hereinafter excepted, knowing or having reason to believe that an officer, soldier, 8 [sailor or airman], in the Army, 9 [Navy or Air Force] of the 10 [Government of India], has deserted, harbours such officer, soldier, 8 [sailor or airman], shall be punished with imprisonment of either description for a term which may extend to two years, or with fine or with both"
  },
  {
    "chapter": "7",
    "section": "137",
    "title": "Deserter concealed on board merchant vessel through negligence of master",
    "description": "he master or person in charge of a merchant vessel, on board of which any deserter from the Army, 9 [Navy or Air Force] of the 10 [Government of India] is concealed, shall, though ignorant of such concealment, be liable to a penalty not exceeding five hundred rupees"
  },
  {
    "chapter": "7",
    "section": "138",
    "title": "Abetment of act of insubordination by soldier, sailor or airman",
    "description": "Whoever abets what he knows to be an act of insubordination by an officer, soldier, 8 [sailor or airman], in the Army, 9 [Navy or air Force], of the 10 [Government of India], shall, if such act of insubordination be committed in consequence of that abetment, be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both"
  },
  {
    "chapter": "7",
    "section": "139",
    "title": "Persons subject to certain Acts",
    "description": "No person subject to 2 [the Army Act, 3 [the Army Act, 1950 (46 of 1950)], the Naval Discipline Act"
  },
  {
    "chapter": "7",
    "section": "140",
    "title": "Wearing garb or carrying token used by soldier, sailor or airman",
    "description": "Whoever, not being a soldier, 9 [sailor or airman] in the Military, 10 [Naval or Air] service of the 11 [Government of India], wears any garb or carries any token resembling any garb or token used by such a soldier, 9 [sailor or airman] with the intention that it may be believed that he is such a soldier, 9 [sailor or airman], shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to five hundred rupees, or with both."
  },
  {
    "chapter": "8",
    "section": "141",
    "title": "Unlawful assembly",
    "description": "An assembly which was not unlawful when it assembled, may subsequently become an unlawful assembly"
  },
  {
    "chapter": "8",
    "section": "142",
    "title": "Being member of unlawful assembly",
    "description": "Whoever, being aware of facts which render any assembly an unlawful assembly, intentionally joins that assembly, or continues in it, is said to be a member of an unlawful assembly"
  },
  {
    "chapter": "8",
    "section": "143",
    "title": "Punishment",
    "description": "Whoever is a member of an unlawful assembly, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both"
  },
  {
    "chapter": "8",
    "section": "144",
    "title": "Joining unlawful assembly armed with deadly weapon",
    "description": "Whoever, being armed with any deadly weapon, or with anything which, used as a weapon of offence, is likely to cause death, is a member of an unlawful assembly, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both"
  },
  {
    "chapter": "8",
    "section": "145",
    "title": "Joining or continuing in unlawful assembly, knowing it has been commanded to disperse",
    "description": "Whoever joins or continues in an unlawful assembly, knowing that such unlawful assembly has been commanded in the manner prescribed by law to disperse, shall be punished with imprisonment of either description for a term which may extent to two years, or with fine, or with both"
  },
  {
    "chapter": "8",
    "section": "146",
    "title": "Rioting",
    "description": "Whenever force or violence is used by an unlawful assembly, or by any member thereof, in prosecution of the common object of such assembly, every member of such assembly is guilty of the offence of rioting"
  },
  {
    "chapter": "8",
    "section": "147",
    "title": "Punishment for rioting",
    "description": "Whoever is guilty of rioting, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both"
  },
  {
    "chapter": "8",
    "section": "148",
    "title": "Rioting, armed with deadly weapon",
    "description": "Whoever is guilty of rioting, being armed with a deadly weapon or with anything which, used as a weapon of offence, is likely to cause death, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both."
  },
  {
    "chapter": "8",
    "section": "149",
    "title": "Every member of unlawful assembly guilty of offence committed in prosecution of common object.",
    "description": "If an offence is committed by any member of an unlawful assembly in prosecution of the common object of that assembly, or such as the members of that assembly knew to be likely to be committed in prosecution of that object, every person who, at the time of the committing of that offence, is a member of the same assembly, is guilty of that offence"
  },
  {
    "chapter": "8",
    "section": "150",
    "title": "Hiring, or conniving at hiring, of persons to join unlawful assembly",
    "description": "Whoever hires or engages, or employs, or promotes, or connives at the hiring, engagement or employment of any person to join or become a member of any unlawful assembly, shall be punishable as a member of such unlawful assembly, and for any offence which may be committed by any such person as a member of such unlawful assembly in pursuance of such hiring, engagement or employment, in the same manner as if he had been a member of such unlawful assembly, or himself had committed such offence"
  },
  {
    "chapter": "8",
    "section": "151",
    "title": "Knowingly joining or continuing in assembly of five or more persons after it has been commanded to disperse",
    "description": "Whoever knowingly joins or continues in any assembly of five or more persons likely to cause a disturbance of the public peace, after such assembly has been lawfully commanded to disperse, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both"
  },
  {
    "chapter": "8",
    "section": "153",
    "title": "Wantonly giving provocation with intent to cause riot—if rioting be committed; if not committed.",
    "description": "Whoever malignantly, or wantonly by doing anything which is illegal, gives provocation to any person intending or knowing it to be likely that such provocation will cause the offence of rioting to be committed, shall, if the offence of rioting be committed in consequence of such provocation, be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both; and if the offence of rioting be not committed, with imprisonment of either description for a term which may extend to six months, or with fine, or with both."
  },
  {
    "chapter": "8",
    "section": "153A",
    "title": "Punishment for knowingly carrying arms in any procession or organising, or holding or taking part in any mass drill or mass training with arms",
    "description": "Whoever knowingly carries arms in any procession or organizes or holds or takes part in any mass drill or mass training with arms in any public place in contravention of any public notice or order issued or made under section 144A of the Code of Criminal Procedure, 1973 (2 of 1974) shall be punished with imprisonment for a term which may extend to six months and with fine which may extend to two thousand rupees"
  },
  {
    "chapter": "8",
    "section": "153B",
    "title": "Imputations, assertions prejudicial to national integration.",
    "description": "Whoever, by words either spoken or written or by signs or by visible representations"
  },
  {
    "chapter": "8",
    "section": "154",
    "title": "Owner or occupier of land on which an unlawful assembly is held",
    "description": "Whenever any unlawful assembly or riot takes place, the owner or occupier of the land upon which such unlawful assembly is held, or such riot is committed, and any person having or claiming an interest in such land, shall be punishable with fine not exceeding one thousand rupees, if he or his agent or manager, knowing that such offence is being or has been committed, or having reason to believe it is likely to be committed, do not give the earliest notice thereof in his or their power to the principal officer at the nearest police-station,"
  },
  {
    "chapter": "8",
    "section": "155",
    "title": "Liability of person for whose benefit riot is committed.",
    "description": "Whenever a riot is committed for the benefit or on behalf of any person who is the owner or occupier of any land respecting which such riot takes place or who claims any interest in such land, or in the subject of any dispute which gave rise to the riot, or who has accepted or derived any benefit therefrom, such person shall be punishable with fine"
  },
  {
    "chapter": "8",
    "section": "156",
    "title": "Liability of agent of owner or occupier for whose benefit riot is committed",
    "description": "Whenever a riot is committed for the benefit or on behalf of any person who is the owner or occupier of any land respecting which such riot takes place, or who claims any interest in such land, or in the subject of any dispute which gave rise to the riot"
  },
  {
    "chapter": "8",
    "section": "157",
    "title": "Harbouring persons hired for an unlawful assembly",
    "description": "Whoever harbours, receives or assembles, in any house or premises in his occupation or charge, or under his control any persons knowing that such persons have been hired, engaged or employed, or are about to be hired, engaged or employed, to join or become members of an unlawful assembly, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both"
  },
  {
    "chapter": "8",
    "section": "158",
    "title": "Being hired to take part in an unlawful assembly or riot",
    "description": "Whoever is engaged, or hired, or offers or attempts to be hired or engaged, to do or assist in doing any of the acts specified in section 141, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both"
  },
  {
    "chapter": "8",
    "section": "159",
    "title": "Affray",
    "description": "When two or more persons, by fighting in a public place, disturb the public peace, they are said to 'commit an affray'"
  },
  {
    "chapter": "8",
    "section": "160",
    "title": "Punishment for committing affray",
    "description": "Whoever commits an affray, shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to one hundred rupees, or with both."
  },
  {
    "chapter": "9",
    "section": "166",
    "title": "Public servant disobeying law, with intent to cause injury to any person",
    "description": "Whoever, being a public servant, knowingly disobeys any direction of the law as to the way in which he is to conduct himself as such public servant, intending to cause, or knowing it to be likely that he will by such disobedience, cause injury to any person, shall be punished with simple imprisonment for a term which may extend to one year, or with fine, or with both"
  },
  {
    "chapter": "9",
    "section": "166A",
    "title": "Public servant disobeying direction under law.",
    "description": "knowingly disobeys any direction of the law which prohibits him from requiring the attendance at any place of any person for the purpose of investigation into an offence or any other matter"
  },
  {
    "chapter": "9",
    "section": "166B",
    "title": "Punishment for non-treatment of victim",
    "description": "Whoever, being in charge of a hospital, public or private, whether run by the Central Government, the State Government, local bodies or any other person, contravenes the provisions of section 357C of the Code of Criminal Procedure, 1973 (2 of 1974), shall be punished with imprisonment for a term which may extend to one year or with fine or with both"
  },
  {
    "chapter": "9",
    "section": "167",
    "title": "Public servant framing an incorrect document with intent to cause injury",
    "description": "Whoever, being a public servant, and being, as 2 [such public servant, charged with the preparation or translation of any document or electronic record, frames, prepares or translates that document or electronic record] in a manner which he knows or believes to be incorrect, intending thereby to cause or knowing it to be likely that he may thereby cause injury to any person, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both"
  },
  {
    "chapter": "9",
    "section": "168",
    "title": "Public servant unlawfully engaging in trade",
    "description": "Whoever, being a public servant, and being legally bound as such public servant not to engage in trade, engages in trade, shall be punished with simple imprisonment for a term which may extend to one year, or with fine, or with both"
  },
  {
    "chapter": "9",
    "section": "169",
    "title": "Public servant unlawfully buying or bidding for property",
    "description": "Whoever, being a public servant, and being legally bound as such public servant, not to purchase or bid for certain property, purchases or bids for that property, either in his own name or in the name of another, or jointly, or in shares with others, shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both; and the property, if purchased, shall be confiscated."
  },
  {
    "chapter": "9",
    "section": "170",
    "title": "Personating a public servant",
    "description": "Whoever pretends to hold any particular office as a public servant, knowing that he does not hold such office or falsely personates any other person holding such office, and in such assumed character does or attempts to do any act under colour of such office, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both"
  },
  {
    "chapter": "9",
    "section": "171",
    "title": "Wearing garb or carrying token used by public servant with fraudulent intent",
    "description": "Whoever, not belonging to a certain class of public servants, wears any garb or carries any token resembling any garb or token used by that class of public servants, with the intention that it may be believed, or with the knowledge that it is likely to be believed, that he belongs to that class of public servants, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to two hundred rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "172",
    "title": "Absconding to avoid service of summons or other proceeding.",
    "description": "Whoever absconds in order to avoid being served with a summons, notice or order proceeding from any public servant legally competent, as such public servant, to issue such summons, notice or order, shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both"
  },
  {
    "chapter": "10",
    "section": "173",
    "title": "Preventing service of summons or other proceeding, or preventing publication thereof",
    "description": "Whoever in any manner intentionally prevents the serving on himself, or on any other person, of any summons, notice or order proceeding from any public servant legally competent, as such public servant, to issue such summons, notice or order"
  },
  {
    "chapter": "10",
    "section": "174",
    "title": "Non-attendance in obedience to an order from public servant.",
    "description": "Whoever, being legally bound to attend in person or by an agent at a certain place and time in obedience to a summons, notice, order, or proclamation proceeding from any public servant legally competent, as such public servant, to issue the same"
  },
  {
    "chapter": "10",
    "section": "174A",
    "title": "Non-appearance in response to a proclamation under section 82 of Act 2 of 1974",
    "description": "Whoever fails to appear at the specified place and the specified time as required by a proclamation published under sub-section (1) of section 82 of the Code of Criminal Procedure, 1973 shall be punished with imprisonment for a term which may extend to three years or with fine or with both, and where a declaration has been made under sub-section (4) of that section pronouncing him as a proclaimed offender, he shall be punished with imprisonment for a term which may extend to seven years and shall also be liable to fine.]"
  },
  {
    "chapter": "10",
    "section": "175",
    "title": "Omission to produce document to public servant by person legally bound to produce it",
    "description": "Whoever, being legally bound to produce or deliver up any 4 [document or electronic record] to any public servant, as such, intentionally omits so to produce or deliver up the same, shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both"
  },
  {
    "chapter": "10",
    "section": "176",
    "title": "Omission to give notice or information to public servant by person legally bound to give it",
    "description": "Whoever, being legally bound to give any notice or to furnish information on any subject to any public servant, as such, intentionally omits to give such notice or to furnish such information in the manner and at the time required by law, shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both"
  },
  {
    "chapter": "10",
    "section": "177",
    "title": "Furnishing false information",
    "description": "Whoever, being legally bound to furnish information on any subject to any public servant, as such, furnishes, as true, information on the subject which he knows or has reason to believe to be false shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both"
  },
  {
    "chapter": "10",
    "section": "178",
    "title": "Refusing oath or affirmation when duly required by public servant to make it",
    "description": "Whoever refuses to bind himself by an oath 4 [or affirmation] to state the truth, when required so to bind himself by a public servant legally competent to require that he shall so bind himself, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both"
  },
  {
    "chapter": "10",
    "section": "179",
    "title": "Refusing to answer public servant authorised to question",
    "description": "Whoever, being legally bound to state the truth on any subject to any public servant, refuses to answer any question demanded of him touching that subject by such public servant in the exercise of the legal powers of such public servant, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both"
  },
  {
    "chapter": "10",
    "section": "180",
    "title": "Refusing to sign statement",
    "description": "Whoever refuses to sign any statement made by him, when required to sign that statement by a public servant legally competent to require that he shall sign that statement, shall be punished with simple imprisonment for a term which may extend to three months, or with fine which may extend to five hundred rupees, or with both"
  },
  {
    "chapter": "10",
    "section": "181",
    "title": "False statement on oath or affirmation to public servant or person authorised to administer an oath or affirmation",
    "description": "Whoever, being legally bound by an oath 4 [or affirmation] to state the truth on any subject to any public servant or other person authorized by law to administer such oath 4 [or affirmation], makes, to such public servant or other person as aforesaid, touching that subject, any statement which is false, and which he either knows or believes to be false or does not believe to be true, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine"
  },
  {
    "chapter": "10",
    "section": "182",
    "title": "False information, with intent to cause public servant to use his lawful power to the injury of another person",
    "description": "Whoever gives to any public servant any information which he knows or believes to be false, intending thereby to cause"
  },
  {
    "chapter": "10",
    "section": "183",
    "title": "Resistance to the taking of property by the lawful authority of a public servant",
    "description": "Whoever offers any resistance to the taking of any property by the lawful authority of any public servant, knowing or having reason to believe that he is such public servant, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both"
  },
  {
    "chapter": "10",
    "section": "184",
    "title": "Obstructing sale of property offered for sale by authority of public servant",
    "description": "Whoever intentionally obstructs any sale of property offered for sale by the lawful authority of any public servant, as such, shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both"
  },
  {
    "chapter": "10",
    "section": "185",
    "title": "Illegal purchase or bid for property offered for sale by authority of public servant",
    "description": "Whoever, at any sale of property held by the lawful authority of a public servant, as such, purchases or bids for any property on account of any person, whether himself or any other, whom he knows to be under a legal incapacity to purchase that property at that sale, or bids for such property not intending to perform the obligations under which he lays himself by such bidding, shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to two hundred rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "186",
    "title": "Obstructing public servant in discharge of public functions",
    "description": "Whoever voluntarily obstructs any public servant in the discharge of his public functions, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to five hundred rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "187",
    "title": "Omission to assist public servant when bound by law to give assistance.",
    "description": "Whoever, being bound by law to render or furnish assistance to any public servant in the execution of his public duty, intentionally omits to give such assistance, shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to two hundred rupees, or with both"
  },
  {
    "chapter": "10",
    "section": "188",
    "title": "Disobedience to order duly promulgated by public servant",
    "description": "Whoever, knowing that, by an order promulgated by a public servant lawfully empowered to promulgate such order, he is directed to abstain from a certain act, or to take certain order with certain property in his possession or under his management, disobeys such direction"
  },
  {
    "chapter": "10",
    "section": "189",
    "title": "Threat of injury to public servant",
    "description": "Whoever holds out any threat of injury to any public servant, or to any person in whom he believes that public servant to be interested, for the purpose of inducing that public servant to do any act, or to forbear or delay to do any act, connected with the exercise of the public functions of such public servant, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "10",
    "section": "190",
    "title": "Threat of injury to induce person to refrain from applying for protection to public servant",
    "description": "Whoever holds out any threat of injury to any person for the purpose of inducing that person to refrain or desist from making a legal application for protection against any injury to any public servant legally empowered as such to give such protection, or to cause such protection to be given, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both"
  },

  {
    "chapter": "10",
    "section": "172",
    "title": "Absconding to avoid service of summons or other proceeding",
    "description": "Whoever absconds in order to avoid being served with a summons, notice or order proceeding from any public servant legally competent, as such public servant, to issue such summons, notice or order, shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both;or, if the summons or notice or order is to attend in person or by agent, or to 1[produce a document or an electronic record in a Court of Justice], with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "173",
    "title": " Preventing service of summons or other proceeding, or preventing publication thereof",
    "description": "Whoever in any manner intentionally prevents the serving on himself, or on any other person, of any summons, notice or order proceeding from any public servant legally competent, as such public servant, to issue such summons, notice or order,or intentionally prevents the lawful affixing to any place of any such summons, notice or order,or intentionally removes any such summons, notice or order from any place to which it is lawfully affixed,or intentionally prevents the lawful making of any proclamation, under the authority of any public servant legally competent, as such public servant, to direct such proclamation to be made,shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both;or, if the summons, notice, order or proclamation is to attend in person or by agent, or 2[to produce a document or electronic record in a Court of Justice] with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "174",
    "title": "Non-attendance in obedience to an order from public servant.",
    "description": "Whoever, being legally bound to attend in person or by an agent at a certain place and time in obedience to a summons, notice, order, or proclamation proceeding from any public servant legally competent, as such public servant, to issue the same,intentionally omits to attend at that place or time, or departs from the place where he is bound to attend before the time at which it is lawful for him to depart,shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both;or, if the summons, notice, order or proclamation is to attend in person or by agent in a Court of Justice, with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both.",
    "additionalInfo": "(a) A, being legally bound to appear before the 1[High Court] at Calcutta, in obedience to a subpoena issuing from that Court, intentionally omits to appear. A has committed the offence defined in this section.(b) A, being legally bound to appear before a 2[District Judge], as a witness, in obedience to a summons issued by that 2[District Judge] intentionally omits to appear. A has committed the offence defined in this section."
  },
  {
    "chapter": "10",
    "section": "174A",
    "title": "Non-appearance in response to a proclamation under section 82 of Act 2 of 1974.",
    "description": "Whoever fails to appear at the specified place and the specified time as required by a proclamation published under sub-section (1) of section 82 of the Code of Criminal Procedure, 1973 shall be punished with imprisonment for a term which may extend to three years or with fine or with both, and where a declaration has been made under sub-section (4) of that section pronouncing him as a proclaimed offender, he shall be punished with imprisonment for a term which may extend to seven years and shall also be liable to fine."
  },
  {
    "chapter": "10",
    "section": "175",
    "title": "Omission to produce document to public servant by person legally bound to produce it.",
    "description": "Whoever, being legally bound to produce or deliver up any 4[document or electronic record] to any public servant, as such, intentionally omits so to produce or deliver up the same, shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both;or, if the 4[document or electronic record] is to be produced or delivered up to a Court of Justice, with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both.",
    "additionalInfo": "A, being legally bound to produce a document before a 5[District Court], intentionally omits to produce the same. A has committed the offence defined in this section."
  },
  {
    "chapter": "10",
    "section": "176",
    "title": "Omission to give notice or information to public servant by person legally bound to give it.",
    "description": "Whoever, being legally bound to give any notice or to furnish information on any subject to any public servant, as such, intentionally omits to give such notice or to furnish such information in the manner and at the time required by law, shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both;or, if the notice or information required to be given respects the commission of an offence, or is required for the purpose of preventing the commission of an offence, or in order to the apprehension of an offender, with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both;6[or, if the notice or information required to be given is required by an order passed under sub-section (1) of section 565 of the Code of Criminal Procedure, 1898 (5 of 1898), with imprisonment of either description for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both.]"
  },
  {
    "chapter": "10",
    "section": "177",
    "title": "Furnishing false information.",
    "description": "Whoever, being legally bound to furnish information on any subject to any public servant, as such, furnishes, as true, information on the subject which he knows or has reason to believe to be false shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both;or, if the information which he is legally bound to give respects the commission of an offence, or is required for the purpose of preventing the commission of an offence, or in order to the apprehension of an offender, with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
    "additionalInfo": "(a) A, a landholder, knowing of the commission of a murder within the limits of his estate, wilfully misinforms the Magistrate of the district that the death has occurred by accident in consequence of the bite of a snake. A is guilty of the offence defined in this section.(b) A, a village watchman, knowing that a considerable body of strangers has passed through his village in order to commit a dacoity in the house of Z, a wealthy merchant residing in a neighbouring place, and being bound under clause 5, section VII, 1Regulation III, 1821, of the Bengal Code, to give early and punctual information of the above fact to the officer of the nearest police-station, wilfully misinforms the police officer that a body of suspicious characters passed through the village with a view to commit dacoity in a certain distant place in a different direction. Here A is guilty of the offence defined in the latter part of this section.[Explanation.—In section 176 and in this section the word “offence” includes any act committed at any place out of 3[India], which, if committed in 3[India], would be punishable under any of the following sections, namely, 302, 304, 382, 392, 393, 394, 395, 396, 397, 398, 399, 402, 435, 436, 449, 450, 457, 458, 459 and 460; and the word “offender” includes any person who is alleged to have been guilty of any such act.]"
  },
  {
    "chapter": "10",
    "section": "178",
    "title": "Refusing oath or affirmation when duly required by public servant to make it.",
    "description": "Whoever refuses to bind himself by an oath 4[or affirmation] to state the truth, when required so to bind himself by a public servant legally competent to require that he shall so bind himself, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "179",
    "title": "Refusing to answer public servant authorised to question",
    "description": "Whoever, being legally bound to state the truth on any subject to any public servant, refuses to answer any question demanded of him touching that subject by such public servant in the exercise of the legal powers of such public servant, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "180",
    "title": "Refusing to sign statement",
    "description": "Whoever refuses to sign any statement made by him, when required to sign that statement by a public servant legally competent to require that he shall sign that statement, shall be punished with simple imprisonment for a term which may extend to three months, or with fine which may extend to five hundred rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "181",
    "title": "False statement on oath or affirmation to public servant or person authorised to administer an oath or affirmation.",
    "description": "Whoever, being legally bound by an oath 4[or affirmation] to state the truth on any subject to any public servant or other person authorized by law to administer such oath 4[or affirmation], makes, to such public servant or other person as aforesaid, touching that subject, any statement which is false, and which he either knows or believes to be false or does not believe to be true, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine."
  },
  {
    "chapter": "10",
    "section": "182",
    "title": "False information, with intent to cause public servant to use his lawful power to the injury of another person.",
    "description": "Whoever gives to any public servant any information which he knows or believes to be false, intending thereby to cause, or knowing it to be likely that he will thereby cause, such public servant-(a) to do or omit anything which such public servant ought not to do or omit if the true state of facts respecting which such information is given were known by him, or(b) to use the lawful power of such public servant to the injury or annoyance of any person,shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both.",
    "additionalInfo": "(a) A informs a Magistrate that Z, a police-officer, subordinate to such Magistrate, has been guilty of neglect of duty or misconduct, knowing such information to be false, and knowing it to be likely that the information will cause the Magistrate to dismiss Z. A has committed the offence defined in this section.(b) A falsely informs a public servant that Z has contraband salt in a secret place, knowing such information to be false, and knowing that it is likely that the consequence of the information will be a search of Z's premises, attended with annoyance to Z. A has committed the offence defined in this section.(c) A falsely informs a policeman that he has been assaulted and robbed in the neighbourhood of a particular village. He does not mention the name of any person as one of his assailants, but knows it to be likely that in consequence of this information the police will make enquiries and institute searches in the village to the annoyance of the villagers or some of them. A has committed an offence under this section.]"
  },
  {
    "chapter": "10",
    "section": "183",
    "title": " Resistance to the taking of property by the lawful authority of a public servant.",
    "description": "Whoever offers any resistance to the taking of any property by the lawful authority of any public servant, knowing or having reason to believe that he is such public servant, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "184",
    "title": "Obstructing sale of property offered for sale by authority of public servant.",
    "description": "Whoever intentionally obstructs any sale of property offered for sale by the lawful authority of any public servant, as such, shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "185",
    "title": "Illegal purchase or bid for property offered for sale by authority of public servant.",
    "description": "Whoever, at any sale of property held by the lawful authority of a public servant, as such, purchases or bids for any property on account of any person, whether himself or any other, whom he knows to be under a legal incapacity to purchase that property at that sale, or bids for such property not intending to perform the obligations under which he lays himself by such bidding, shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to two hundred rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "186",
    "title": "Obstructing public servant in discharge of public functions.",
    "description": "Whoever voluntarily obstructs any public servant in the discharge of his public functions, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to five hundred rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "187",
    "title": "Omission to assist public servant when bound by law to give assistance.",
    "description": "Whoever, being bound by law to render or furnish assistance to any public servant in the execution of his public duty, intentionally omits to give such assistance, shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to two hundred rupees, or with both;and if such assistance be demanded of him by a public servant legally competent to make such demand for the purposes of executing any process lawfully issued by a Court of Justice, or of preventing the commission of an offence, or suppressing a riot, or affray, or of apprehending a person charged with or guilty of an offence, or of having escaped from lawful custody, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five hundred rupees, or with both."
  },
  {
    "chapter": "10",
    "section": "188",
    "title": "Disobedience to order duly promulgated by public servant.",
    "description": "Whoever, knowing that, by an order promulgated by a public servant lawfully empowered to promulgate such order, he is directed to abstain from a certain act, or to take certain order with certain property in his possession or under his management, disobeys such direction,shall, if such disobedience causes or tends to cause obstruction, annoyance or injury, or risk of obstruction, annoyance or injury, to any persons lawfully employed, be punished with simple imprisonment for a term which may extend to one month or with fine which may extend to two hundred rupees, or with both;and if such disobedience causes or tends to cause danger to human life, health or safety, or causes or tends to cause a riot or affray, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both.Explanation.—It is not necessary that the offender should intend to produce harm, or contemplate his disobedience as likely to produce harm. It is sufficient that he knows of the order which he disobeys, and that his disobedience produces, or is likely to produce, harm.",
    "additionalInfo": "An order is promulgated by a public servant lawfully empowered to promulgate such order, directing that a religious procession shall not pass down a certain street. A knowingly disobeys the order, and thereby causes danger of riot. A has committed the offence defined in this section."
  },
  {
    "chapter": "10",
    "section": "189",
    "title": "Threat of injury to public servant.",
    "description": "Whoever holds out any threat of injury to any public servant, or to any person in whom he believes that public servant to be interested, for the purpose of inducing that public servant to do any act, or to forbear or delay to do any act, connected with the exercise of the public functions of such public servant, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "10",
    "section": "190",
    "title": "Threat of injury to induce person to refrain from applying for protection to public servant.",
    "description": "Whoever holds out any threat of injury to any person for the purpose of inducing that person to refrain or desist from making a legal application for protection against any injury to any public servant legally empowered as such to give such protection, or to cause such protection to be given, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "191",
    "title": "Giving false evidence",
    "description": "Whoever, being legally bound by an oath or by an express provision of law to state the truth, or being bound by law to make a declaration upon any subject, makes any statement which is false, and which he either knows or believes to be false or does not believe to be true, is said to give false evidence.Explanation1.—A statement is within the meaning of this section, whether it is made verbally or otherwise.Explanation 2.—A false statement as to the belief of the person attesting is within the meaning of this section, and a person may be guilty of giving false evidence by stating that he believes a thing which he does not believe, as well as by stating that he knows a thing which he does not know.",
    "additionalInfo": "(a) A, in support of a just claim which B has against Z for one thousand rupees, falsely swears on a trial that he heard Zadmit the justice of B's claim. A has given false evidence.(b) A, being bound by an oath to state the truth, states that he believes a certain signature to be the handwriting of Z, when he does not believe it to be the handwriting of Z. Here A states that which he knows to be false, and therefore gives false evidence.(c) A, knowing the general character of Z's handwriting, states that he believes a certain signature to be the handwriting of Z; A in good faith believing it to be so. Here A's statement is merely as to his belief, and is true as to his belief, and therefore, although the signature may not be the handwriting of Z, A has not given false evidence.(d) A, being bound by an oath to state the truth, states that he knows that Z was at a particular place on a particular day, not knowing anything upon the subject. A gives false evidence whether Z was at that place on the day named or not.(e) A, an interpreter or translator, gives or certifies as a true interpretation or translation of a statement or document which he is bound by oath to interpret or translate truly, that which is not and which he does not believe to be a true interpretation or translation. A has given false evidence."
  },
  {
    "chapter": "11",
    "section": "192",
    "title": "Fabricating false evidence",
    "description": "Whoever causes any circumstance to exist or 1[makes any false entry in any book or record, or electronic record or makes any document or electronic record containing a false statement,] intending that such circumstance, false entry or false statement may appear in evidence in a judicial proceeding, or in a proceeding taken by law before a public servant as such, or before an arbitrator, and that such circumstance, false entry or false statement, so appearing in evidence, may cause any person who in such proceeding is to form an opinion upon the evidence, to entertain an erroneous opinion touching any point material to the result of such proceeding is said “to fabricate false evidence”.",
    "additionalInfo": "(a) A puts jewels into a box belonging to Z, with the intention that they may be found in that box, and that this circumstancemay cause Z to be convicted of theft. A has fabricated false evidence.(b) A makes a false entry in his shop-book for the purpose of using it as corroborative evidence in a Court of Justice. A has fabricated false evidence.(c) A, with the intention of causing Z to be convicted of a criminal conspiracy, writes a letter in imitation of Z's handwriting, purporting to be addressed to an accomplice in such criminal conspiracy, and puts the letter in a place which he knows that the officers of the police are likely to search. A has fabricated false evidence."
  },
  {
    "chapter": "11",
    "section": "193",
    "title": "Punishment for false evidence.",
    "description": "Whoever intentionally gives false evidence in any of a judicial proceeding, or fabricates false evidence for the purpose of being used in any stage of a judicial proceeding, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine;and whoever intentionally gives or fabricates false evidence in any other case, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.Explanation 1.—A trial before a Court-martial1***is a judicial proceeding.Explanation 2.—An investigation directed by law preliminary to a proceeding before a Court of Justice, is a stage of a judicial proceeding, though that investigation may not take place before a Court of Justice.",
    "additionalInfo": "A, in an enquiry before a Magistrate for the purpose of ascertaining whether Z ought to be committed for trial, makes on oath a statement which he knows to be false. As this enquiry is a stage of a judicial proceeding, A as given false evidence.Explanation 3.—An investigation directed by a Court of Justice according to law, and conducted under the authority of a Court of Justice, is a stage of a judicial proceeding, though that investigation may not take place before a Court of Justice."
  },
  {
    "chapter": "11",
    "section": "194",
    "title": "Giving or fabricating false evidence with intent to procure conviction of capital offence.",
    "description": "Whoever gives or fabricates false evidence, intending thereby to cause, or knowing it to be likely that he will thereby cause, any person to be convicted of an offence which is capital 2[by the law for the time being in force in 3[India]] shall be punished with 4[imprisonment for life], or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine;If innocent person be thereby convicted and executed.—and if an innocent person be convicted and executed in consequence of such false evidence, the person who gives such false evidence shall be punished either with death or the punishment hereinbefore described."
  },
  {
    "chapter": "11",
    "section": "195",
    "title": "Giving or fabricating false evidence with intent to procure conviction of offence punishable with imprisonment for life or imprisonment",
    "description": "Whoever gives or fabricates false evidence intending thereby to cause, or knowing it to be likely that he will thereby cause, any person to be convicted of an offence which 2[by the law for the time being in force in 3[India]] is not capital, but punishable with 4[imprisonment for life], or imprisonment for a term of seven years or upwards, shall be punished as a person convicted of that offence would be liable to be punished.",
    "additionalInfo": "A gives false evidence before a Court of Justice, intending thereby to cause Z to be convicted of a dacoity. The punishment of dacoity is 1[imprisonment for life], or rigorous imprisonment for a term which may extend to ten years, with or without fine. A, therefore, is liable to 2[imprisonment for life] or imprisonment, with or without fine."
  },
  {
    "chapter": "11",
    "section": "195A",
    "title": "Threatening any person to give false evidence",
    "description": "Whoever threatens another with any injury to his person, reputation or property or to the person or reputation of any one in whom that person is interested, with intent to cause that person to give false evidence shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both;  and if innocent person is convicted and sentenced in consequence of such false evidence, with death or imprisonment for more than seven years, the person who threatens shall be punished with the same punishment and sentence in the same manner and to the same extent such innocent person is punished and sentenced.]"
  },
  {
    "chapter": "11",
    "section": "196",
    "title": "Using evidence known to be false.",
    "description": "Whoever corruptly uses or attempts to use as true or genuine evidence any evidence which he knows to be false or fabricated, shall be punished in the same manner as if he gave or fabricated false evidence."
  },
  {
    "chapter": "11",
    "section": "197",
    "title": " Issuing or signing false certificate",
    "description": "Whoever issues or signs any certificate required by law to be given or signed, or relating to any fact of which such certificate is by law admissible in evidence, knowing or believing that such certificate is false in any material point, shall be punished in the same manner as if he gave false evidence."
  },
  {
    "chapter": "11",
    "section": "198",
    "title": "Using as true a certificate known to be false",
    "description": "Whoever corruptly uses or attempts to use any such certificate as a true certificate, knowing the same to be false in any material point, shall be punished in the same manner as if he gave false evidence."
  },
  {
    "chapter": "11",
    "section": "199",
    "title": "False statement made in declaration which is by law receivable as evidence",
    "description": "Whoever, in any declaration made or subscribed by him, which declaration any Court of Justice, or any public servant or other person, is bound or authorised by law to receive as evidence of any fact, makes any statement which is false, and which he either knows or believes to be false or does not believe to be true, touching any point material to the object for which the declaration is made or used, shall be punished in the same manner as if he gave false evidence."
  },
  {
    "chapter": "11",
    "section": "200",
    "title": "Using as true such declaration knowing it to be false.",
    "description": "Whoever corruptly uses or attempts to use as true any such declaration, knowing the same to be false in any material point, shall be punished in the same manner as if he gave false evidence.Explanation.—A declaration which is inadmissible merely upon the ground of some informality, is a declaration within the meaning of sections 199 and 200."
  },
  {
    "chapter": "11",
    "section": "201",
    "title": "Causing disappearance of evidence of offence, or giving false information to screen offender.",
    "description": "Whoever, knowing or having reason to believe that an offence has been committed, causes any evidence of the commission of that offence to disappear, with the intention of screening the offender from legal punishment, or with that intention gives any information respecting the offence which he knows or believes to be false",
    "additionalInfo": "A, knowing that B has murdered Z, assists B to hide the body with the intention of screening B from punishment. A is liable to imprisonment of either description for seven years, and also to fine."
  },
  {
    "chapter": "11",
    "section": "202",
    "title": " Intentional omission to give information of offence by person bound to inform.",
    "description": "Whoever, knowing or having reason to believe that an offence has been committed, intentionally omits to give any information respecting that offence which he is legally bound to give, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "203",
    "title": "Giving false information respecting an offence committed",
    "description": "Whoever, knowing or having reason to believe that an offence has been committed, gives any information respecting that offence which he knows or believes to be false, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.1[Explanation.—In sections 201 and 202 and in this section the word “offence” includes any act committed at any place out of 2[India], which, if committed in 2[India], would be punishable under any of the following sections, namely, 302, 304, 382, 392, 393, 394, 395, 396, 397, 398, 399, 402, 435, 436, 449, 450, 457, 458, 459 and 460.]"
  },
  {
    "chapter": "11",
    "section": "204",
    "title": "Destruction of document to prevent its production as evidence",
    "description": "Whoever secretes or destroys any 3[document and electronic record] which he may be lawfully compelled to produce as evidence in a Court of Justice, or in any proceeding lawfully held before a public servant, as such, or obliterates or renders illegible the whole or any part of such 3[document or electronic record] with the intention of preventing the same from being produced or used as evidence before such Court or public servant as aforesaid, or after he shall have been lawfully summoned or required to produce the same for that purpose, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "205",
    "title": "False personation for purpose of act or proceeding in suit or prosecution",
    "description": "Whoever falsely personates another, and in such assumed character makes any admission or statement, or confesses judgment, or causes any process to be issued or becomes bail or security, or does any other act in any suit or criminal prosecution, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "206",
    "title": "Fraudulent removal or concealment of property to prevent its seizure as forfeited or in execution.",
    "description": "Whoever fraudulently removes, conceals, transfers or delivers to any person any property or any interest therein, intending thereby to prevent that property or interest therein from being taken as a forfeiture or in satisfaction of a fine, under a sentence which has been pronounced, or which he knows to be likely to be pronounced, by a Court of Justice or other competent authority, or from being taken in execution of a decree or order which has been made, or which he knows to be likely to be made by a Court of Justice in a civil suit, shall be punished with imprisonment of either description for a term which may extend to two years or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "207",
    "title": " Fraudulent claim to property to prevent its seizure as forfeited or in execution.",
    "description": "Whoever fraudulently accepts, receives or claims any property or any interest therein, knowing that he has no right or rightful claim to such property or interest, or practices any deception touching any right to any property or any interest therein, intending thereby to prevent that property or interest therein from being taken as a forfeiture or in satisfaction of a fine, under a sentence which has been pronounced, or which he knows to be likely to be pronounced by a Court of Justice or other competent authority, or from being taken in execution of a decree or order which has been made, or which he knows to be likely to be made by a Court of Justice in a civil suit, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "208",
    "title": "Fraudulently suffering decree for sum not due",
    "description": "Whoever fraudulently causes or suffers a decree or order to be passed against him at the suit of any person for a sum not due or for a larger sum than is due to such person or for any property or interest in property to which such person is not entitled, or fraudulently causes or suffers a decree or order to be executed against him after it has been satisfied, or for anything in respect of which it has been satisfied, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
    "additionalInfo": "A institutes a suit against Z. Z, knowing that A is likely to obtain a decree against him, fraudulently suffers a judgment to pass against him for a larger amount at the suit of B, who has no just claim against him, in order that B, either on his own account or for the benefit of Z, may share in the proceeds of any sale of Z's property which may be made under A's decree. Z has committed an offence under this section."
  },
  {
    "chapter": "11",
    "section": "209",
    "title": "Dishonesty making false claim in Court",
    "description": "Whoever fraudulently or dishonestly, or with intent to injure or annoy any person, makes in a Court of Justice any claim which he knows to be false, shall be punished with imprisonment of either description for a term which may extend to two years, and shall also be liable to fine."
  },
  {
    "chapter": "11",
    "section": "210",
    "title": " Fraudulently obtaining decree for sum not due",
    "description": "Whoever fraudulently obtains a decree or order against any person for a sum not due, or for a larger sum than is due or for any property or interest in property to which he is not entitled, or fraudulently causes a decree or order to be executed against any person after it has been satisfied or for anything in respect of which it has been satisfied, or fraudulently suffers or permits any such act to be done in his name, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "211",
    "title": "False charge of offence made with intent to injure.",
    "description": "Whoever, with intent to cause injury to any person, institutes or causes to be instituted any criminal proceeding against that person, or falsely charges any person with having committed an offence, knowing that there is no just or lawful ground for such proceeding or charge against that person, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both;and if such criminal proceeding be instituted on a false charge of an offence punishable with death, 1[imprisonment for life], or imprisonment for seven years or upwards, shall be punishable with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "11",
    "section": "212",
    "title": "Harbouring offender.",
    "description": "Whenever an offence has been committed, whoever harbours or conceals a person whom he knows or has reason to believe to be the offender, with the intention of screening him from legal punishment,if a capital offence.—shall, if the offence is punishable with death, be punished with imprisonment of either description for a term which may extend to five years, and shall also be liable to fine;if punishable with imprisonment for life, or with imprisonment.—and if the offence is punishable with 1[imprisonment for life], or with imprisonment which may extend to ten years, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine;and if the offence is punishable with imprisonment which may extend to one year, and not to ten years, shall be punished with imprisonment of the description provided for the offence for a term which may extend to one-fourth part of the longest term of imprisonment provided for the offence, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "213",
    "title": "Taking gift, etc., to screen an offender from punishment.",
    "description": "Whoever accepts or attempts to obtain, or agrees to accept, any gratification for himself or any other person, or any restitution of property to himself or any other person, in consideration of his concealing an offence or of his screening any person from legal punishment for any offence, or of his not proceeding against any person for the purpose of bringing him to legal punishment,"
  },
  {
    "chapter": "11",
    "section": "214",
    "title": "Offering gift or restoration of property in consideration of screening offender.",
    "description": "Whoever gives or causes, or offers or agrees to give or cause, any gratification to any person, or 2[restores or causes the restoration of] any property to any person, in consideration of that person's concealing an offence, or of his screening any person from legal punishment for any offence, or of his not proceeding against any person for the purpose of bringing him to legal punishment,if a capital offence.—shall, if the offence is punishable with death, be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine;if punishable with imprisonment for life, or with imprisonment.—and if the offence is punishable with 1[imprisonment for life] or with imprisonment which may extend to ten years, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine;and if the offence is punishable with imprisonment not extending to ten years, shall be punished with imprisonment of the description provided for the offence for a term which may extend to one-fourth part of the longest term of imprisonment provided for the offence, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "215",
    "title": "Taking gift to help to recover stolen property, etc",
    "description": "Whoever takes or agrees or consents to take any gratification under pretence or on account of helping any person to recover any movable property of which he shall have been deprived by any offence punishable under this Code, shall, unless he uses all means in his power to cause the offender to be apprehended and convicted of the offence, be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "216",
    "title": "Harbouring offender who has escaped from custody or whose apprehension has been ordered.",
    "description": "Whenever any person convicted of a charged with an offence, being in lawful custody for that offence, escapes from such custody,or whenever a public servant, in the exercise of the lawful powers of such public servant, orders a certain person to be apprehended for an offence, whoever, knowing of such escape or order for apprehension, harbours or conceals that person with the intention of preventing him from being apprehended, shall be punished in the manner following, that is to say,"
  },
  {
    "chapter": "11",
    "section": "217",
    "title": "Public servant disobeying direction of law with intent to save person from punishment or property from forfeiture.",
    "description": "Whoever, being a public servant, knowingly disobeys any direction of the law as to the way in which he is to conduct himself as such public servant, intending thereby to save, or knowing it to be likely that he will thereby save, any person from legal punishment, or subject him to a less punishment than that to which he is liable, or with intent to save, or knowing that he is likely thereby to save, any property from forfeiture or any charge to which it is liable by law, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "218",
    "title": "Public servant framing incorrect record or writing with intent to save person from punishment or property from forfeiture.",
    "description": "Whoever, being a public servant, and being as such public servant, charged with the preparation of any record or other writing, frames that record or writing in a manner which he knows to be incorrect, with intent to cause, or knowing it to be likely that he will thereby cause, loss or injury to the public or to any person, or with intent thereby to save, or knowing it to be likely that he will thereby save, any person from legal punishment, or with intent to save, or knowing that he is likely thereby to save, any property from forfeiture or other charge to which it is liable by law, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "219",
    "title": "Public servant in judicial proceeding corruptly making report, etc., contrary to law.",
    "description": "Whoever, being a public servant, corruptly or maliciously makes or pronounces in any stage of a judicial proceeding, any report, order, verdict, or decision which he knows to be contrary to law, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "220",
    "title": "Commitment for trial or confinement by person having authority who knows that he is acting contrary to law.",
    "description": "Whoever, being in any office which gives him legal authority to commit persons for trial or to confinement, or to keep persons in confinement, corruptly or maliciously commits any person for trial or to confinement, or keeps any person in confinement, in the exercise of that authority knowing that in so doing he is acting contrary to law, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "221",
    "title": "Intentional omission to apprehend on the part of public servant bound to apprehend.",
    "description": "Whoever, being a public servant, legally bound as such public servant to apprehend or to keep in confinement any person charged with or liable to be apprehended for an offence, intentionally omits to apprehend such person, or intentionally suffers such person to escape, or intentionally aids such person in escaping or attempting to escape from such confinement, shall be punished as follows, that is to say:— with imprisonment of either description for a term which may extend to seven years, with or without fine, if the person in confinement, or who ought to have been apprehended, was charged with, or liable to be apprehended for, an offence punishable with death; or with imprisonment of either description for a term which may extend to three years, with or without fine, if the person in confinement, or who ought to have been apprehended, was charged with, or liable to be apprehended for, an offence punishable with 1[imprisonment for life] or imprisonment for a term which may extend to ten years; or with imprisonment of either description for a term which may extend to two years, with or without fine, if the person in confinement, or who ought to have been apprehended, was charged with, or liable to be apprehended for, an offence punishable with imprisonment for a term less than ten years."
  },
  {
    "chapter": "11",
    "section": "222",
    "title": "Intentional omission to apprehend on the part of public servant bound to apprehend person under sentence or lawfully committed.",
    "description": "Whoever, being a public servant, legally bound as such public servant to apprehend or to keep in confinement any person under sentence of a Court of Justice for any offence 2[or lawfully committed to custody], intentionally omits to apprehend such person, or intentionally suffers such person to escape or intentionally aids such person in escaping or attempting to escape from such confinement, shall be punished as follows, that is to say:— with 1[imprisonment for life] or with imprisonment of either description for a term which may extend to fourteen years, with or without fine, if the person in confinement, or who ought to have been apprehended, is under sentence of death; or with imprisonment of either description for a term which may extend to seven years, with or without fine, if the person in confinement or who ought to have been apprehended, is subject, by a sentence of a Court of Justice, or by virtue of a commutation of such sentence, to 1[imprisonment for life] 3*** 4*** 5*** 6*** or imprisonment for a term of ten years, or upwards; or with imprisonment of either description for a term which may extend to three years, or with fine, or with both, if the person in confinement or who ought to have been apprehended is subject by a sentence of a Court of Justice, to imprisonment for a term not extending to ten years 2[or if the person was lawfully committed to custody]"
  },
  {
    "chapter": "11",
    "section": "223",
    "title": "Escape from confinement or custody negligently suffered by public servant",
    "description": "Whoever, being a public servant legally bound as such public servant to keep in confinement any person charged with or convicted of any offence 1[or lawfully committed to custody], negligently suffers such person to escape from confinement, shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "224",
    "title": "Resistance or obstruction by a person to his lawful apprehension.",
    "description": "Whoever intentionally offers any resistance or illegal obstruction to the lawful apprehension of himself for any offence with which he is charged or of which he has been convicted, or escapes or attempts to escape from any custody in which he is lawfully detained for any such offence, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "225",
    "title": "Resistance or obstruction to lawful apprehension of another person",
    "description": "Whoever intentionally offers any resistance or illegal obstruction to the lawful apprehension of any other person for an offence, or rescues or attempts to rescue any other person from any custody in which that person is lawfully detained for an offence, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both; or, if the person to be apprehended, or the person rescued or attempted to be rescued, is charged with or liable to be apprehended for an offence punishable with 2[imprisonment for life] or imprisonment for a term which may extend to ten years, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine"
  },
  {
    "chapter": "11",
    "section": "226",
    "title": "Unlawful return from transportation.",
    "description": "Rep. by the Code of Criminal Procedure (Amendment) Act, 1955 (26 of 1955), s. 117 and the Sch (w.e.f. 1-1-1956)."
  },
  {
    "chapter": "11",
    "section": "227",
    "title": "Violation of condition of remission of punishment.",
    "description": "Whoever, having accepted any conditional remission of punishment, knowingly violates any condition on which such remission was granted, shall be punished with the punishment to which he was originally sentenced, if he has already suffered no part of that punishment, and if he has suffered any part of that punishment, then with so much of that punishment as he has not already suffered."
  },
  {
    "chapter": "11",
    "section": "228",
    "title": "Intentional insult or interruption to public servant sitting in judicial proceeding",
    "description": "Whoever intentionally offers any insult, or causes any interruption to any public servant, while such public servant is sitting in any stage of a judicial proceeding, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both."
  },
  {
    "chapter": "11",
    "section": "228A",
    "title": "Disclosure of identity of the victim of certain offences, etc.",
    "description": "Whoever prints or publishes the name or any matter which may make known the identity of any person against whom an 2[offence under section 376, section 376A, section 376B, section 376C, section 376D or section 376E] is alleged or found to have been committed (hereafter in this section referred to as the victim) shall be punished with imprisonment of either description for a term which may extend to two years and shall also be liable to fine."
  },
  {
    "chapter": "11",
    "section": "229",
    "title": " Personation of a juror or assessor",
    "description": "Whoever, by personation or otherwise, shall intentionally cause, or knowingly suffer himself to be returned, empanelled or sworn as a juryman or assessor in any case in which he knows that he is not entitled by law to be so returned, empanelled or sworn, or knowing himself to have been so returned, empanelled or sworn contrary to law, shall voluntarily serve on such jury or as such assessor, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "11",
    "section": "229A",
    "title": "Failure by person released on bail or bond to appear in court.",
    "description": "hoever, having been charged with an offence and released on bail or on bond without sureties, fails without sufficient cause (the burden of proving which shall lie upon him), to appear in court in accordance with the terms of the bail or bond, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.Explanation.—The punishment under this section is—(a) in addition to the punishment to which the offender would be liable on a conviction for the offence with which he has been charged; and (b) without prejudice to the power of the court to order forfeiture of the bond.]"
  },
  {
    "chapter": "12",
    "section": "230",
    "title": "“Coin” defined.",
    "description": "[Coin is metal used for the time being as money, and stamped and issued by the authority of some State or Sovereign Power in order to be so used.]",
    "additionalInfo": "(a) Cowries are not coin.(b) Lumps of unstamped copper, though used as money, are not coin.(c) Medals are not coin, inasmuch as they are not intended to be used as money.(d) The coin denominated as the Company's rupee is 4[Indian coin]."
  },
  {
    "chapter": "12",
    "section": "231",
    "title": "Counterfeiting coin.",
    "description": "Whoever counterfeits or knowingly performs any part of the process of counterfeiting coin, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "232",
    "title": "Counterfeiting Indian coin.",
    "description": "Whoever counterfeits, or knowingly performs any part of the process of counterfeiting 4[Indian coin], shall be punished with 7[imprisonment for life], or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "233",
    "title": "Making or selling instrument for counterfeiting coin",
    "description": "Whoever makes or mends, or performs any part of the process of making or mending, or buys, sells or disposes of, any die or instrument, for the purpose of being used, or knowing or having reason to believe that it is intended to be used, for the purpose of counterfeiting coin, shall be punished with imprisonment of either description for a term which may extended to three years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "234",
    "title": "Making or selling instrument for counterfeiting Indian coin",
    "description": "hoever makes or mends, or performs any part of the process of making or mending or buys, sells or disposes of, any die or instrument, for the purpose of being used, or knowing or having reason to believe that it is intended to be used, for the purpose of counterfeiting 1[Indian coin], shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "235",
    "title": "Possession of instrument or material for the purpose of using the same for counterfeiting coin.",
    "description": "Whoever is in possession of any instrument or material, for the purpose of using the same for counterfeiting coin, or knowing or having reason to believe that the same is intended to be used for that purpose, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine;if Indian coin.—and if the coin to be counterfeited is 1[Indian coin], shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "236",
    "title": "Abetting in India the counterfeiting out of India of coin.",
    "description": "Whoever, being within 2[India] abets the counterfeiting of coin out of 2[India] shall be punished in the same manner as if he abetted the counterfeiting of such coin within 2[India]."
  },
  {
    "chapter": "12",
    "section": "237",
    "title": "Import or export of counterfeit coin",
    "description": "Whoever imports into 2[India], or exports therefrom, any counterfeit coin, knowing or having reason to believe that the same is counterfeit, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "238",
    "title": "Import or export of counterfeits of the Indian coin.",
    "description": "Whoever imports into 2[India], or exports therefrom, any counterfeit coin, which he knows or has reason to believe to be a counterfeit of 1[Indian coin], shall be punished with 3[Imprisonment for life], or with imprisonment of either description description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "239",
    "title": "Delivery of coin, possessed with knowledge that it is counterfeit.",
    "description": "Whoever, having any counterfeit coin, which at the time when he became possessed of it, he knew to be counterfeit, fraudulently or with intent that fraud may be committed, delivers the same to any persons or attempts to induce any person to receive it, shall be punished with imprisonment of either description for a term which may extend to five years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "240",
    "title": " Delivery of Indian coin, possessed with knowledge that it is counterfeit.",
    "description": "Whoever, having any counterfeit coin which is a counterfeit of 1[Indian coin], and which, at the time when he became possessed of it, he knew to be a counterfeit of 1[Indian coin], fraudulently or with intent that fraud may be committed, delivers the same to any person, or attempts to induce any person to receive it, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "241",
    "title": "Delivery of coin as genuine, which, when first possessed, the deliverer did not know to be counterfeit.",
    "description": "Whoever delivers to any other person as genuine, or attempts to induce any other person to receive as genuine, any counterfeit coin which he knows to be counterfeit, but which he did not know to be counterfeit at the time when he took it into his possession, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine to an amount which may extend to ten times the value of the coin counterfeited, or with both."
  },
  {
    "chapter": "12",
    "section": "242",
    "title": "Possession of counterfeit coin by person who knew it to be counterfeit when he became possessed thereof.",
    "description": "Whoever, fraudulently or with intent that fraud may be committed, is in possession of counterfeit coin, having known at the time when he became possessed thereof that such coin was counterfeit, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "243",
    "title": "Possession of Indian coin by person who knew it to be counterfeit when he became possessed thereof",
    "description": "Whoever, fraudulently or with intent that fraud may be committed, is in possession of counterfeit coin, which is a counterfeit of 1[Indian coin], having known at the time when he became possessed of it that it was counterfeit, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "244",
    "title": " Person employed in mint causing coin to be of different weight or composition from that fixed by law",
    "description": "Whoever, being employed in any mint lawfully established in 2[India], does any act, or omits what he is legally bound to do, with the intention of causing any coin issued from that mint to be of a different weight or composition from the weight or composition fixed by law, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "245",
    "title": " Unlawfully taking coining instrument from mint.",
    "description": "Whoever, without lawful authority, takes out of any mint, lawfully established in 2[India], any coining tool or instrument, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "246",
    "title": "Fraudulently or dishonestly diminishing weight or altering composition of coin",
    "description": "Whoever, fraudulently or dishonestly performs on any coin any operation which diminishes the weight or alters the composition of that coin, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "247",
    "title": "Fraudulently or dishonestly diminishing weight or altering composition of Indian coin.",
    "description": "Whoever fraudulently or dishonestly performs on 3[any Indian coin] any operation which diminishes the weight or alters the composition of that coin, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "248",
    "title": "Altering appearance of coin with intent that it shall pass as coin of different description",
    "description": "Whoever performs on any coin any operation which alters the appearance of that coin, with the intention that the said coin shall pass as a coin of a different description, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "249",
    "title": "Altering appearance of Indian coin with intent that it shall pass as coin of different description",
    "description": "Whoever performs on 3[any Indian coin] any operation which alters the appearance of that coin, with the intention that the said coin shall pass as a coin of a different description, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "250",
    "title": "Delivery of coin, possessed with knowledge that it is altered.",
    "description": "Whoever, having coin in his possession with respect to which the offence defined in section 246 or 248 has been committed, and having known at the time when he became possessed of such coin that such offence had been committed with respect to it, fraudulently or with intent that fraud may be committed, delivers such coin to any other person, or attempts to induce any other person to receive the same, shall be punished with imprisonment of either description for a term which may extend to five years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "251",
    "title": "Delivery of Indian coin, possessed with knowledge that it is altered.",
    "description": "Whoever, having coin in his possession with respect to which the offence defined in section 247 or 249 has been committed, and having known at the time when he became possessed of such coin that such offence had been committed with respect to it, fraudulently or with intent that fraud may be committed, delivers such coin to any other person, or attempts to induce any other person to receive the same, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "252",
    "title": "Possession of coin by person who knew it to be altered when he became possessed thereof.",
    "description": "Whoever fraudulently or with intent that fraud may be committed, is in possession of coin with respect to which the offence defined in either of the section 246 or 248 has been committed, having known at the time of becoming possessed thereof that such offence had been committed with respect to such coin, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "253",
    "title": "Possession of Indian coin by person who knew it to be altered when he became possessed thereof.",
    "description": "Whoever, fraudulently or with intent that fraud may be committed, is in possession of coin with respect to which the offence defined in either of the section 247 or 249 has been committed having known at the time of becoming possessed thereof, that such offence had been committed with respect to such coin, shall be punished with imprisonment of either description for a term which may extend to five years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "254",
    "title": "Delivery of coin as genuine which, when first possessed, the deliverer did not know to be altered.",
    "description": "Whoever delivers to any other person as genuine or as a coin of a different description from what it is, or attempts to induce any person to receive as genuine, or as a different coin from what it is, any coin in respect of which he knows that any such operation as that mentioned in sections 246, 247, 248 or 249 has been performed, but in respect of which he did not, at the time when he took it into his possession, know that such operation had been performed, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine to an amount which may extend to ten times the value of the coin for which the altered coin is passed, or attempted to be passed."
  },
  {
    "chapter": "12",
    "section": "255",
    "title": "Counterfeiting Government stamp.",
    "description": "Whoever counterfeits, or knowingly performs any part of the process of counterfeiting, any stamp issued by Government for the purpose of revenue shall be punished with 1[imprisonment for life] or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "256",
    "title": "Having possession of instrument or material for counterfeiting Government stamp.",
    "description": "Whoever has in his possession any instrument or material for the purpose of being used, or knowing or having reason to believe that it is intended to be used, for the purpose of counterfeiting any stamp issued by Government for the purpose of revenue, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "257",
    "title": "Making or selling instrument for counterfeiting Government stamp.",
    "description": "Whoever makes or performs any part of the process of making, or buys, or sells, or disposes or, any instrument for the purpose of being used, or knowing or having reason to believe that it is intended to be used, for the purpose of counterfeiting any stamp issued by Government for the purpose of revenue, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "258",
    "title": "Sale of counterfeit Government stamp",
    "description": "Whoever sells, or offers for sale, any stamp which he knows or has reason to believe to be a counterfeit of any stamp issued by Government for the purpose of revenue, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "259",
    "title": "Having possession of counterfeit Government stamp.",
    "description": "Whoever has in his possession any stamp which he knows to be a counterfeit of any stamp issued by Government for the purpose of revenue, intending to use, or dispose of the same as a genuine stamp, or in order that it may be used as a genuine stamp, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "chapter": "12",
    "section": "260",
    "title": "Using as genuine a Government stamp known to be counterfeit.",
    "description": "Whoever uses as genuine any stamp, knowing it to be a counterfeit of any stamp issued by Government for the purpose of revenue,shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both."
  },
  {
    "chapter": "12",
    "section": "261",
    "title": "Effacing writing from substance bearing Government stamp, or removing from document a stamp used for it, with intent to cause loss to Government.",
    "description": "Whoever, fraudulently or with intent to cause loss to the Government, removes or effaces from any substance, bearing any stamp issued by Government for the purpose of revenue, any writing or document for which such stamp has been used, or removes from any writing or document a stamp which has been used for such writing or document, in order that such stamp may be used for a different writing or document, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both."
  },
  {
    "chapter": "12",
    "section": "262",
    "title": "Using Government stamp known to have been before used.",
    "description": "Whoever, fraudulently or with intent to cause loss to the Government, uses for any purpose a stamp issued by Government for the purpose of revenue, which he knows to have been before used, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "12",
    "section": "263",
    "title": "Erasure of mark denoting that stamp has been used.",
    "description": "Whoever, fraudulently or with intent to cause loss to Government, erases or removes from a stamp issued by Government for the purpose of revenue, any mark, put or impressed upon such stamp for the purpose of denoting that the same has been used, or knowingly has in his possession or sells or disposes of any such stamp from which such mark has been erased or removed, or sells or disposes of any such stamp which he knows to have been used, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both."
  },
  {
    "chapter": "13",
    "section": "264",
    "title": "Fraudulent use of false instrument for weighing",
    "description": "Whoever, fraudulently uses any instrument for weighing which he knows to be false, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
  },
  {
    "chapter": "13",
    "section": "265",
    "title": "Fraudulent use of false weight or measure.",
    "description": "Whoever, fraudulently uses any false weight or false measure of length or capacity, or fraudulently uses any weight or any measure of length or capacity as a different weight or measure from what it is, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
  },

  {
    "chapter": "13",
    "section": "266",
    "title": "Being in possession of false weight or measure.",
    "description": "Whoever is in possession of any instrument for weighing, or of any weight, or of any measure of length or capacity, which he knows to be false,ntending that the same may be fraudulently used, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
  },

  {
    "chapter": "13",
    "section": "267",
    "title": "Making or selling false weight or measure.",
    "description": "Whoever makes, sells or disposes of any instrument for weighing, or any weight, or any measure of length or capacity which he knows to be false, in order that the same may be used as true, or knowing that the same is likely to be used as true, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
  },
  {
    "chapter": "15",
    "section": "295",
    "title": "Injuring or defiling place of worship, with intent to insult the religion of any class.",
    "description": "Whoever destroys, damages or defiles any place of worship, or any object held sacred by any class of persons with the intention of thereby insulting the religion of any class of persons or with the knowledge that any class of persons is likely to consider such destruction, damage or defilement as an insult to their religion, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "chapter": "15",
    "section": "295A",
    "title": "Deliberate and malicious acts, intended to outrage religious feelings of any class by insulting its religion or religious beliefs.",
    "description": "Whoever, with deliberate and malicious intention of outraging the religious feelings of any class of 2[citizens of India], 3[by words, either spoken or written, or or by signs or by visible representations or otherwise], insults or attempts to insult the religion or the religious beliefs of that class, shall be punished with imprisonment of either description for a term which may extend to 4[three years], or with fine, or with both.]"
  },
  {
    "chapter": "15",
    "section": "296",
    "title": "Disturbing religious assembly.",
    "description": "Whoever voluntarily causes disturbance to any assembly lawfully engaged in the performance of religious worship, or religious ceremonies, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
  },
  {
    "chapter": "15",
    "section": "297",
    "title": "Trespassing on burial places, etc.",
    "description": "Whoever, with the intention of wounding the feelings of any person, or of insulting the religion of any person or with the knowledge that the feelings of any person are likely to be wounded, or that the religion of any person is likely to be insulted thereby,commits any trespass in any place of worship or on any place of sepulture, or any place set apart for the performance of funeral rites or as a depository for the remains of the dead, or offers any indignity to any human corpse, or causes disturbance to any persons assembled for the performance of funeral ceremonies,shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
  },
  {
    "chapter": "15",
    "section": "298",
    "title": "Uttering words, etc., with deliberate intent to wound religious feelings.",
    "description": "Whoever, with the deliberate intention of wounding the religious feelings of any person, utters any word or makes any sound in the hearing of that person or makes any gesture in the sight of that persons or places any object in the sight of that person, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both."
  }
]
